content/dotemacs.org
#+title: dotemacs
#+author: Eduardo T. Fernandes (etbcf)
#+property: header-args:emacs-lisp :tangle ./init.el :mkdirp yes
#+startup: show2levels

* Configurações relacionadas com repositórios e use-package

#+begin_src emacs-lisp
  
  ;; inicializar fontes de pacotes
  (require 'package)

  (setq package-archives
        '(("gnu" . "https://elpa.gnu.org/packages/")
          ("melpa" . "https://melpa.org/packages/")
          ("org" . "https://orgmode.org/elpa/")))


  (package-initialize)

  ;; instalar use-package só se não estiver
  (unless (package-installed-p 'use-package)
    (package-refresh-contents) ;; corre só UMA vez se o use-package não estiver instalado
    (package-install 'use-package))

  (require 'use-package)

  ;; auto instalar pacotes quando for necessário
  (setq use-package-always-ensure t)

  ;; opcional: prevenir chamadas acidentais de rede
  (setq package-enable-at-startup nil)

#+end_src

* auto-tangle ficheiros de configuração

#+begin_src emacs-lisp

  ;; automatically tangle emacs.org config file when saved
  (defun etbcf/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name "~/.emacs.d/dotemacs.org"))
      ;; dynamic scope to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

        (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'etbcf/org-babel-tangle-config)))
  
#+end_src

* Manter as pastas do Emacs limpas

** No littering

Este é uma solução mantida pela comunidade.

https://github.com/emacscollective/no-littering

#+begin_src emacs-lisp

  (use-package no-littering
    :ensure t
    :custom
    (custom-file (no-littering-expand-etc-file-name "custom.el"))
    :config
    (no-littering-theme-backups))

#+end_src

* Fontaine

** Instalação

#+begin_src emacs-lisp

  ;; tornar ficheiros Elisp na pasta =~/.emacs.d/manual-packages/fontaine= disponíveis ao utilizador
  (add-to-list 'load-path "~/.emacs.d/manual-packages/fontaine")
  
#+end_src

