docs/dotemacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>dotemacs</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">dotemacs</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1df4aea">Configurações relacionadas com repositórios e use-package</a></li>
<li><a href="#org8c1a665">auto-tangle ficheiros de configuração</a></li>
<li><a href="#orga20bdd1">Manter as pastas do Emacs limpas</a>
<ul>
<li><a href="#org43ffc0b">No littering</a></li>
</ul>
</li>
<li><a href="#orgb5584d8">Fontaine</a>
<ul>
<li><a href="#org543871e">Instalação</a></li>
<li><a href="#orge4c9c99">Configuração</a></li>
</ul>
</li>
<li><a href="#orgbe729a5">Interface e algumas configurações de histórico</a></li>
<li><a href="#orge130b04">Esquema de cores que altera automáticamente para esquema para dia e noite</a></li>
<li><a href="#orgc92a053">Prompt para escolher em que navegador abrir um URL, EWW ou Firefox</a></li>
<li><a href="#org1879a10">Alertas com BEEP</a></li>
<li><a href="#org6c7390d">Desativa o número de linhas para modos</a></li>
<li><a href="#org410418c">ibuffer</a></li>
<li><a href="#orgbf4efa8">Which key</a></li>
<li><a href="#org2445b95">Diminish</a></li>
<li><a href="#orgf2aced4">Verico, marginalia, consult, orderless and embark</a>
<ul>
<li><a href="#orgece86f9">Configuração básica</a></li>
</ul>
</li>
<li><a href="#org23858c4">Org</a>
<ul>
<li><a href="#org0e679da">Configuração básica</a></li>
<li><a href="#org8f4d73d">Configurar linguagens babel</a></li>
<li><a href="#org014482f">Modelos struturados</a></li>
<li><a href="#org921c2d2">Indentação</a></li>
</ul>
</li>
<li><a href="#orgd2d29ce">Ir para a última modificação</a></li>
<li><a href="#org066befb">Funções para abrir uma nova linha em cima, em baixo e indentar corretamente</a>
<ul>
<li><a href="#org1f1a08a">Abrir uma linha em cima e em baixo e colocar o cursor no lugar correto.</a></li>
<li><a href="#orgef8e0cb">Função para criar um novo buffer</a></li>
<li><a href="#org75eaaad">Função para dar feedback ao copiar</a></li>
</ul>
</li>
<li><a href="#org0797d1e">Alguns programas</a>
<ul>
<li><a href="#org38d3e0c">Windmove</a></li>
<li><a href="#orgb7e7aee">Buffer-move</a></li>
<li><a href="#org5e7a6c9">Cursores múltiplos</a></li>
</ul>
</li>
<li><a href="#org5facce3">Programação</a>
<ul>
<li><a href="#org793e1ef">Caminho para os executáveis (Importante para o NVM)</a></li>
<li><a href="#orgc9e6556">LSP para Python e Bash</a></li>
<li><a href="#org266ba40">Web development</a></li>
<li><a href="#org78c50ab">Emmet</a></li>
<li><a href="#org63f53c7">Apheleia</a></li>
<li><a href="#org7edb6b1">Rainbow delimiters</a></li>
<li><a href="#orgf4859b1">Projectile</a></li>
<li><a href="#org37b80cd">Magit</a></li>
<li><a href="#orgc61b2a5">Configuração do blamer</a></li>
<li><a href="#org5b581d8">Company</a></li>
<li><a href="#orgde38c6a">Flycheck</a></li>
</ul>
</li>
<li><a href="#orgdfbb65e">Terminais</a>
<ul>
<li><a href="#org5c41b20">Term</a></li>
<li><a href="#org889db0c">vterm</a></li>
<li><a href="#orgf4c8ecc">eshell</a></li>
</ul>
</li>
<li><a href="#orgf0c7d9e">Gestão de ficheiros</a>
<ul>
<li><a href="#org00549de">Dired</a></li>
<li><a href="#orgdf3c1d5">Dired async</a></li>
<li><a href="#org9833cb1">Peep dired</a></li>
<li><a href="#org5cac35e">Dired subtree</a></li>
<li><a href="#org764fec4">Abrir</a></li>
</ul>
</li>
<li><a href="#orgd7ed35d">Procura</a>
<ul>
<li><a href="#org3c1a046">Melhorias no Isearch</a></li>
<li><a href="#org05db425">Redução de espaços em branco</a></li>
<li><a href="#org93c1277">Estatísticas</a></li>
</ul>
</li>
<li><a href="#org6a5351e">Escrita</a>
<ul>
<li><a href="#org113e710">Visual-line-e-flyspell-modo</a></li>
<li><a href="#org91b346d">Margens</a></li>
<li><a href="#org63a826b">Modo olivetti</a></li>
<li><a href="#org352a1c9">Contagem de palavras</a></li>
<li><a href="#orgad69b3f">Dicionário</a></li>
</ul>
</li>
<li><a href="#orgc9195dc">denote-journal</a>
<ul>
<li><a href="#orgc145396">Carregamento do Elisp denote-journal</a></li>
<li><a href="#org86e155a">Configuração do denote-journal</a></li>
</ul>
</li>
<li><a href="#orgbfa864e">Music</a>
<ul>
<li><a href="#org73e4abd">Bongo</a></li>
</ul>
</li>
<li><a href="#org8eb4b4e">Email</a>
<ul>
<li><a href="#org45418a5">mu4e</a></li>
</ul>
</li>
<li><a href="#org7bf9d97">Elfeed</a>
<ul>
<li><a href="#org56ef367">Configuração do elfeed</a></li>
</ul>
</li>
<li><a href="#orga68807e">Ativar winner-mode</a>
<ul>
<li><a href="#org8cd6743">Winner-mode</a></li>
</ul>
</li>
<li><a href="#org8476c19">Burly</a></li>
<li><a href="#org84f37ef">Modeline</a></li>
<li><a href="#org4686c7b">IELM</a></li>
<li><a href="#orgf0fdcd5">Simple-httpd</a></li>
</ul>
</div>
</div>
<div id="outline-container-org1df4aea" class="outline-2">
<h2 id="org1df4aea">Configurações relacionadas com repositórios e use-package</h2>
<div class="outline-text-2" id="text-org1df4aea">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">inicializar fontes de pacotes
</span>(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">package</span>)

(<span style="font-weight: bold;">setq</span> package-archives
      '((<span style="font-style: italic;">"gnu"</span> . <span style="font-style: italic;">"https://elpa.gnu.org/packages/"</span>)
        (<span style="font-style: italic;">"melpa"</span> . <span style="font-style: italic;">"https://melpa.org/packages/"</span>)
        (<span style="font-style: italic;">"org"</span> . <span style="font-style: italic;">"https://orgmode.org/elpa/"</span>)))


(package-initialize)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">instalar use-package s&#243; se n&#227;o estiver
</span>(<span style="font-weight: bold;">unless</span> (package-installed-p 'use-package)
  (package-refresh-contents) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">corre s&#243; UMA vez se o use-package n&#227;o estiver instalado
</span>  (package-install 'use-package))

(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">use-package</span>)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">auto instalar pacotes quando for necess&#225;rio
</span>(<span style="font-weight: bold;">setq</span> use-package-always-ensure t)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">opcional: prevenir chamadas acidentais de rede
</span>(<span style="font-weight: bold;">setq</span> package-enable-at-startup nil)

</pre>
</div>
</div>
</div>
<div id="outline-container-org8c1a665" class="outline-2">
<h2 id="org8c1a665">auto-tangle ficheiros de configuração</h2>
<div class="outline-text-2" id="text-org8c1a665">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">automatically tangle emacs.org config file when saved
</span>(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">etbcf/org-babel-tangle-config</span> ()
  (<span style="font-weight: bold;">when</span> (string-equal (buffer-file-name)
                      (expand-file-name <span style="font-style: italic;">"~/.emacs.d/dotemacs.org"</span>))
    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">dynamic scope to the rescue
</span>    (<span style="font-weight: bold;">let</span> ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

      (add-hook 'org-mode-hook (<span style="font-weight: bold;">lambda</span> () (add-hook 'after-save-hook #'etbcf/org-babel-tangle-config)))

</pre>
</div>
</div>
</div>
<div id="outline-container-orga20bdd1" class="outline-2">
<h2 id="orga20bdd1">Manter as pastas do Emacs limpas</h2>
<div class="outline-text-2" id="text-orga20bdd1">
</div>
<div id="outline-container-org43ffc0b" class="outline-3">
<h3 id="org43ffc0b">No littering</h3>
<div class="outline-text-3" id="text-org43ffc0b">
<p>
Este é uma solução mantida pela comunidade.
</p>

<p>
<a href="https://github.com/emacscollective/no-littering">https://github.com/emacscollective/no-littering</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> no-littering
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:custom</span>
  (custom-file (no-littering-expand-etc-file-name <span style="font-style: italic;">"custom.el"</span>))
  <span style="font-weight: bold;">:config</span>
  (no-littering-theme-backups))

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb5584d8" class="outline-2">
<h2 id="orgb5584d8">Fontaine</h2>
<div class="outline-text-2" id="text-orgb5584d8">
</div>
<div id="outline-container-org543871e" class="outline-3">
<h3 id="org543871e">Instalação</h3>
<div class="outline-text-3" id="text-org543871e">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">tornar ficheiros Elisp na pasta =~/.emacs.d/manual-packages/fontaine= dispon&#237;veis ao utilizador
</span>(add-to-list 'load-path <span style="font-style: italic;">"~/.emacs.d/manual-packages/fontaine"</span>)

</pre>
</div>
</div>
</div>
