docs/dotemacs.html
<div id="outline-container-orge4c9c99" class="outline-3">
<h3 id="orge4c9c99">Configuração</h3>
<div class="outline-text-3" id="text-orge4c9c99">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">fontaine</span>)

(<span style="font-weight: bold;">setq</span> fontaine-latest-state-file
      (locate-user-emacs-file <span style="font-style: italic;">"fontaine-latest-state.eld"</span>))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Aporetic is my highly customised build of Iosevka:
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;"><a href="https://github.com/protesilaos/aporetic">&lt;https://github.com/protesilaos/aporetic&gt;</a>.
</span>(<span style="font-weight: bold;">setq</span> fontaine-presets
      '((small
         <span style="font-weight: bold;">:default-family</span> <span style="font-style: italic;">"Aporetic Serif Mono"</span>
         <span style="font-weight: bold;">:default-height</span> 80
         <span style="font-weight: bold;">:variable-pitch-family</span> <span style="font-style: italic;">"Aporetic Sans"</span>)
        (regular) <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">like this it uses all the fallback values and is named `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">regular</span><span style="font-weight: bold; font-style: italic;">'
</span>        (medium
         <span style="font-weight: bold;">:default-weight</span> semilight
         <span style="font-weight: bold;">:default-height</span> 115
         <span style="font-weight: bold;">:bold-weight</span> extrabold)
        (large
         <span style="font-weight: bold;">:inherit</span> medium
         <span style="font-weight: bold;">:default-height</span> 150)
        (presentation
         <span style="font-weight: bold;">:default-height</span> 180)
        (t
         <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">I keep all properties for didactic purposes, but most can be
</span>         <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">omitted.  See the fontaine manual for the technicalities:
</span>         <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;"><a href="https://protesilaos.com/emacs/fontaine">&lt;https://protesilaos.com/emacs/fontaine&gt;</a>.
</span>         <span style="font-weight: bold;">:default-family</span> <span style="font-style: italic;">"Aporetic Sans Mono"</span>
         <span style="font-weight: bold;">:default-weight</span> regular
         <span style="font-weight: bold;">:default-height</span> 100

         <span style="font-weight: bold;">:fixed-pitch-family</span> nil <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">falls back to :default-family
</span>         <span style="font-weight: bold;">:fixed-pitch-weight</span> nil <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">falls back to :default-weight
</span>         <span style="font-weight: bold;">:fixed-pitch-height</span> 1.0

         <span style="font-weight: bold;">:fixed-pitch-serif-family</span> nil <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">falls back to :default-family
</span>         <span style="font-weight: bold;">:fixed-pitch-serif-weight</span> nil <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">falls back to :default-weight
</span>         <span style="font-weight: bold;">:fixed-pitch-serif-height</span> 1.0

         <span style="font-weight: bold;">:variable-pitch-family</span> <span style="font-style: italic;">"Aporetic Serif"</span>
         <span style="font-weight: bold;">:variable-pitch-weight</span> nil
         <span style="font-weight: bold;">:variable-pitch-height</span> 1.0

         <span style="font-weight: bold;">:mode-line-active-family</span> nil <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">falls back to :default-family
</span>         <span style="font-weight: bold;">:mode-line-active-weight</span> nil <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">falls back to :default-weight
</span>         <span style="font-weight: bold;">:mode-line-active-height</span> 0.9

         <span style="font-weight: bold;">:mode-line-inactive-family</span> nil <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">falls back to :default-family
</span>         <span style="font-weight: bold;">:mode-line-inactive-weight</span> nil <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">falls back to :default-weight
</span>         <span style="font-weight: bold;">:mode-line-inactive-height</span> 0.9

         <span style="font-weight: bold;">:header-line-family</span> nil <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">falls back to :default-family
</span>         <span style="font-weight: bold;">:header-line-weight</span> nil <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">falls back to :default-weight
</span>         <span style="font-weight: bold;">:header-line-height</span> 0.9

         <span style="font-weight: bold;">:line-number-family</span> nil <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">falls back to :default-family
</span>         <span style="font-weight: bold;">:line-number-weight</span> nil <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">falls back to :default-weight
</span>         <span style="font-weight: bold;">:line-number-height</span> 1.0

         <span style="font-weight: bold;">:tab-bar-family</span> nil <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">falls back to :default-family
</span>         <span style="font-weight: bold;">:tab-bar-weight</span> nil <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">falls back to :default-weight
</span>         <span style="font-weight: bold;">:tab-bar-height</span> 1.0

         <span style="font-weight: bold;">:tab-line-family</span> nil <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">falls back to :default-family
</span>         <span style="font-weight: bold;">:tab-line-weight</span> nil <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">falls back to :default-weight
</span>         <span style="font-weight: bold;">:tab-line-height</span> 1.0

         <span style="font-weight: bold;">:bold-family</span> nil <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">use whatever the underlying face has
</span>         <span style="font-weight: bold;">:bold-weight</span> bold

         <span style="font-weight: bold;">:italic-family</span> nil
         <span style="font-weight: bold;">:italic-slant</span> italic

         <span style="font-weight: bold;">:line-spacing</span> nil)))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set the last preset or fall back to desired style from `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">fontaine-presets</span><span style="font-weight: bold; font-style: italic;">'
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(the `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">regular</span><span style="font-weight: bold; font-style: italic;">' in this case).
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(fontaine-set-preset (or (fontaine-restore-latest-preset) 'regular))
</span>
(<span style="font-weight: bold;">when</span> (display-graphic-p)
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set the last preset or fall back to `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">regular</span><span style="font-weight: bold; font-style: italic;">'.
</span>(fontaine-set-preset
 (<span style="font-weight: bold;">or</span> (fontaine-restore-latest-preset) 'regular))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Persist the latest font preset when closing/starting Emacs and
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">while switching between themes.
</span>(fontaine-mode 1))

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my/italic-comments</span> ()
  (set-face-attribute 'font-lock-comment-face nil
                      <span style="font-weight: bold;">:slant</span> 'italic)
  (set-face-attribute 'font-lock-doc-face nil
                      <span style="font-weight: bold;">:slant</span> 'italic))

(add-hook 'after-init-hook #'my/italic-comments)
(add-hook 'server-after-make-frame-hook #'my/italic-comments)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">fontaine does not define any key bindings.  This is just a sample that
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">respects the key binding conventions.  Evaluate:
</span><span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">
</span><span style="font-weight: bold; font-style: italic;">;;     </span><span style="font-weight: bold; font-style: italic;">(info "(elisp) Key Binding Conventions")
</span>(define-key global-map (kbd <span style="font-style: italic;">"C-c f"</span>) #'fontaine-set-preset)

</pre>
</div>
</div>
</div>
</div>
