content/dotemacs.org
* Interface e algumas configurações de histórico

#+begin_src emacs-lisp

  ;; desativar informações do início quando o Emacs é executado
  (setq inhibit-startup-message t)

  ;; outras configurações da interface
  (menu-bar-mode -1)            ; no menu bar
  (tool-bar-mode -1)            ; no tools bar
  (scroll-bar-mode -1)          ; no scroll bars
  (tooltip-mode -1)             ; no tooltips
  (set-fringe-mode 10)          ; frame edges set to 10px
  (column-number-mode 1)        ; modeline shows column number
  (save-place-mode 1)           ; remember cursor position
  (recentf-mode 1)              ; remember recent files
  (savehist-mode 1)             ; enable history saving

  ;; destaque da linha atual
  ;; (global-hl-line-mode 1)

  ;; prompt de confirmação simplificado
  (fset 'yes-or-no-p 'y-or-n-p)

  ;; apagar texto selecionado ao escrever
  (delete-selection-mode t)

  ;; selecionar incrementalmente
  (use-package expand-region
    :config
    (global-set-key (kbd "C-=") 'er/expand-region))

  ;; quebra de linha visual
  (setq inhibit-startup-message t)

  ;; carregar alterações externas
  (global-auto-revert-mode t)

  ;; ativar fechamento de conjunto de pares
  (electric-pair-mode 1)

  ;; quebra de linha visual
  (global-visual-line-mode t)

  ;; Ajustes para melhorar a utilização
  (global-unset-key (kbd "C-z"))

  ;; Scrolling mais suave
  (setq mouse-wheel-scroll-amount '(2 ((shift) . 1))
        mouse-wheel-progress-speed nil
        mouse-wheel-follow-mouse 't
        scroll-step 1)

  ;; Indentação correta em blocos de código
  (setq org-src-tab-acts-natively t)
  (setq org-src-preserve-indentation nil)
  (setq org-edit-src-content-indentation 0)

  ;; Não indentar conteúdo segundo o nível do cabeçalho
  (setq org-adapt-indentation nil)

#+end_src

* Esquema de cores que altera automáticamente para esquema para dia e noite

#+begin_src emacs-lisp

  (defun carregar-esquema-baseado-na-hora ()
    "Carregar modus-operandi durante o dia e modus vivendi durante a noite."
    (interactive)
    (let* ((hour (string-to-number (format-time-string "%H")))
  	 (day-theme 'modus-operandi-deuteranopia)
  	 (night-theme 'modus-vivendi-deuteranopia))
      (if (and (>= hour 6) (< hour 18))
  	(unless (member day-theme custom-enabled-themes)
  	  (load-theme day-theme t))
        (unless (member night-theme custom-enabled-themes) (load-theme night-theme t)))))
  (defun iniciar-cronometro-do-esquema ()
    "Iniciar um cronómetro para verificar hora e carregar o esquema de cores apropriado."
    (run-with-timer 0 (* 30 60) 'carregar-esquema-baseado-na-hora))

  ;; inicia o cronómetro
  (iniciar-cronometro-do-esquema)

  (setq modus-themes-common-palette-overrides
        '((bg-fringe bg-main)
          (bg-line-number-inactive bg-main)
          (bg-line-number-active bg-main)))

#+end_src

* Prompt para escolher em que navegador abrir um URL, EWW ou Firefox

#+begin_src emacs-lisp

  (defun abrir-url (url &optional new-window)
      "Prompt para abrir URL no EWW ou Firefox."
      (interactive (browse-url-interactive-arg "URL: "))
      (let ((choice (completing-read "Abrir URL no EWW ou Firefox (e/f): "
                                      '("e" "f"))))
        (cond
         ((string-equal choice "e")
          (eww-browse-url url new-window))
         ((string-equal choice "f")
          (browse-url-firefox url new-window))
         (t
          (message "Escolha inválida!")))))

    (setq browse-url-browser-function 'abrir-url)

#+end_src

* Alertas com BEEP

#+begin_src emacs-lisp

  (setq ring-bell-function
          (lambda ()
            (start-process
             "bell"
             nil
             "paplay"
             "/home/etbcf/sounds/beep-alert.mp3"))) ;; erros

    (global-set-key (kbd "C-c s t") #'org-timer-set-timer)

  (defun etbcf/som-do-cronometro-org ()
      "Toca um som quando o org-timer terminal."
      (start-process
       "org-timer-sound"
       nil
       "paplay"
       "/home/etbcf/sounds/beep-pomodoro.wav"))

    (add-hook 'org-timer-done-hook #'etbcf/som-do-cronometro-org)

#+end_src

