docs/dotemacs.html
<div id="outline-container-orgbe729a5" class="outline-2">
<h2 id="orgbe729a5">Interface e algumas configurações de histórico</h2>
<div class="outline-text-2" id="text-orgbe729a5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">desativar informa&#231;&#245;es do in&#237;cio quando o Emacs &#233; executado
</span>(<span style="font-weight: bold;">setq</span> inhibit-startup-message t)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">outras configura&#231;&#245;es da interface
</span>(menu-bar-mode -1)            <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">no menu bar
</span>(tool-bar-mode -1)            <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">no tools bar
</span>(scroll-bar-mode -1)          <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">no scroll bars
</span>(tooltip-mode -1)             <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">no tooltips
</span>(set-fringe-mode 10)          <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">frame edges set to 10px
</span>(column-number-mode 1)        <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">modeline shows column number
</span>(save-place-mode 1)           <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">remember cursor position
</span>(recentf-mode 1)              <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">remember recent files
</span>(savehist-mode 1)             <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">enable history saving
</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">destaque da linha atual
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(global-hl-line-mode 1)
</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">prompt de confirma&#231;&#227;o simplificado
</span>(fset 'yes-or-no-p 'y-or-n-p)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">apagar texto selecionado ao escrever
</span>(delete-selection-mode t)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">selecionar incrementalmente
</span>(<span style="font-weight: bold;">use-package</span> expand-region
  <span style="font-weight: bold;">:config</span>
  (global-set-key (kbd <span style="font-style: italic;">"C-="</span>) 'er/expand-region))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">quebra de linha visual
</span>(<span style="font-weight: bold;">setq</span> inhibit-startup-message t)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">carregar altera&#231;&#245;es externas
</span>(global-auto-revert-mode t)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">ativar fechamento de conjunto de pares
</span>(electric-pair-mode 1)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">quebra de linha visual
</span>(global-visual-line-mode t)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Ajustes para melhorar a utiliza&#231;&#227;o
</span>(global-unset-key (kbd <span style="font-style: italic;">"C-z"</span>))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Scrolling mais suave
</span>(<span style="font-weight: bold;">setq</span> mouse-wheel-scroll-amount '(2 ((shift) . 1))
      mouse-wheel-progress-speed nil
      mouse-wheel-follow-mouse 't
      scroll-step 1)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Indenta&#231;&#227;o correta em blocos de c&#243;digo
</span>(<span style="font-weight: bold;">setq</span> org-src-tab-acts-natively t)
(<span style="font-weight: bold;">setq</span> org-src-preserve-indentation nil)
(<span style="font-weight: bold;">setq</span> org-edit-src-content-indentation 0)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">N&#227;o indentar conte&#250;do segundo o n&#237;vel do cabe&#231;alho
</span>(<span style="font-weight: bold;">setq</span> org-adapt-indentation nil)

</pre>
</div>
</div>
</div>
<div id="outline-container-orge130b04" class="outline-2">
<h2 id="orge130b04">Esquema de cores que altera automáticamente para esquema para dia e noite</h2>
<div class="outline-text-2" id="text-orge130b04">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">carregar-esquema-baseado-na-hora</span> ()
  <span style="font-style: italic;">"Carregar modus-operandi durante o dia e modus vivendi durante a noite."</span>
  (<span style="font-weight: bold;">interactive</span>)
  (<span style="font-weight: bold;">let*</span> ((hour (string-to-number (format-time-string <span style="font-style: italic;">"%H"</span>)))
         (day-theme 'modus-operandi-deuteranopia)
         (night-theme 'modus-vivendi-deuteranopia))
    (<span style="font-weight: bold;">if</span> (<span style="font-weight: bold;">and</span> (&gt;= hour 6) (&lt; hour 18))
        (<span style="font-weight: bold;">unless</span> (member day-theme custom-enabled-themes)
          (load-theme day-theme t))
      (<span style="font-weight: bold;">unless</span> (member night-theme custom-enabled-themes) (load-theme night-theme t)))))
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">iniciar-cronometro-do-esquema</span> ()
  <span style="font-style: italic;">"Iniciar um cron&#243;metro para verificar hora e carregar o esquema de cores apropriado."</span>
  (run-with-timer 0 (* 30 60) 'carregar-esquema-baseado-na-hora))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">inicia o cron&#243;metro
</span>(iniciar-cronometro-do-esquema)

(<span style="font-weight: bold;">setq</span> modus-themes-common-palette-overrides
      '((bg-fringe bg-main)
        (bg-line-number-inactive bg-main)
        (bg-line-number-active bg-main)))

</pre>
</div>
</div>
</div>
<div id="outline-container-orgc92a053" class="outline-2">
<h2 id="orgc92a053">Prompt para escolher em que navegador abrir um URL, EWW ou Firefox</h2>
<div class="outline-text-2" id="text-orgc92a053">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">abrir-url</span> (url <span style="font-weight: bold; text-decoration: underline;">&amp;optional</span> new-window)
    <span style="font-style: italic;">"Prompt para abrir URL no EWW ou Firefox."</span>
    (<span style="font-weight: bold;">interactive</span> (browse-url-interactive-arg <span style="font-style: italic;">"URL: "</span>))
    (<span style="font-weight: bold;">let</span> ((choice (completing-read <span style="font-style: italic;">"Abrir URL no EWW ou Firefox (e/f): "</span>
                                    '(<span style="font-style: italic;">"e"</span> <span style="font-style: italic;">"f"</span>))))
      (<span style="font-weight: bold;">cond</span>
       ((string-equal choice <span style="font-style: italic;">"e"</span>)
        (eww-browse-url url new-window))
       ((string-equal choice <span style="font-style: italic;">"f"</span>)
        (browse-url-firefox url new-window))
       (t
        (message <span style="font-style: italic;">"Escolha inv&#225;lida!"</span>)))))

  (<span style="font-weight: bold;">setq</span> browse-url-browser-function 'abrir-url)

</pre>
</div>
</div>
</div>
<div id="outline-container-org1879a10" class="outline-2">
<h2 id="org1879a10">Alertas com BEEP</h2>
<div class="outline-text-2" id="text-org1879a10">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">setq</span> ring-bell-function
        (<span style="font-weight: bold;">lambda</span> ()
          (start-process
           <span style="font-style: italic;">"bell"</span>
           nil
           <span style="font-style: italic;">"paplay"</span>
           <span style="font-style: italic;">"/home/etbcf/sounds/beep-alert.mp3"</span>))) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">erros
</span>
  (global-set-key (kbd <span style="font-style: italic;">"C-c s t"</span>) #'org-timer-set-timer)

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">etbcf/som-do-cronometro-org</span> ()
    <span style="font-style: italic;">"Toca um som quando o org-timer terminal."</span>
    (start-process
     <span style="font-style: italic;">"org-timer-sound"</span>
     nil
     <span style="font-style: italic;">"paplay"</span>
     <span style="font-style: italic;">"/home/etbcf/sounds/beep-pomodoro.wav"</span>))

  (add-hook 'org-timer-done-hook #'etbcf/som-do-cronometro-org)

</pre>
</div>
</div>
</div>
