content/dotemacs.org
* Desativa o número de linhas para modos

#+begin_src emacs-lisp

  (global-display-line-numbers-mode 1)
  (setq display-line-numbers-type 'relative) 

  ;; Define a list of modes where line numbers should be disabled
  (defvar etbcf/disable-line-numbers-modes
    '(org-mode
      term-mode
      eshell-mode
      vterm-mode
      treemacs-mode
      text-mode
      shell-mode
      dired-mode
      mu4e-main-mode
      mu4e-headers-mode
      mu4e-view-mode
      bongo-playlist-mode
      elfeed-search-mode
      elfeed-show-mode)
    "Modes where `display-line-numbers-mode` should be turned off.")

  ;; Function to disable line numbers in those modes
  (defun etbcf/disable-line-numbers ()
    "Disable line numbers in selected major modes."
    (when (member major-mode etbcf/disable-line-numbers-modes)
      (display-line-numbers-mode 0)))

  ;; Hook the function into major mode changes
  (add-hook 'after-change-major-mode-hook #'etbcf/disable-line-numbers)

#+end_src

* ibuffer

Pedi emprestada ao Mike Zamansky esta configuração do ibuffer.
[[https://www.youtube.com/playlist?list=PL9KxKa8NpFxIcNQa9js7dQQIHc81b0-Xg][Serie de vídeos no YouTube do Mike Zamansky acerca do Emacs.]]

#+begin_src emacs-lisp

  (global-set-key (kbd "C-c i") 'ibuffer)

    (setq ibuffer-saved-filter-groups
  	(quote (("default"
  		 ("text" (mode . text-mode))
  		 ("dired" (mode . dired-mode))
  		 ("org" (name . "^.*org$"))

  		 ("web" (or (mode . web-mode) (mode . js2-mode)))
  		 ("shell" (or (mode . eshell-mode) (mode . shell-mode)))
  		 ("mu4e" (name . "\*mu4e\*"))
  		 ("programming" (or
  				 (mode . python-mode)
  				 (mode . c++-mode)
  				 (mode . sh-mode)))
  		 ("emacs" (or
  			   (name . "^\\*scratch\\*$")
  			   (name . "^\\*messages\\*$")))
  		 ))))

    (add-hook 'ibuffer-mode-hook
  	    (lambda ()
  	      (ibuffer-auto-mode 1)
  	      (ibuffer-switch-to-saved-filter-groups "default")))

#+end_src

* Which key

Ajuda a encontrar comandos.
O repositório pode ser encontrado na seguinte hiperligação [[https://github.com/justbur/emacs-which-key][which-key]]

#+begin_src emacs-lisp

  (use-package which-key

    :defer 0
    :init
    :diminish which-key-mode
    :config
    (which-key-mode)
    (setq which-key-idle-delay 2))

#+end_src

* Diminish

Torna o mode line do Emacs mais limpo retirando o as abreviações dos diferentes modos.

#+begin_src emacs-lisp

  (use-package diminish)

#+end_src

* Verico, marginalia, consult, orderless and embark

