docs/dotemacs.html
<div id="outline-container-org6c7390d" class="outline-2">
<h2 id="org6c7390d">Desativa o número de linhas para modos</h2>
<div class="outline-text-2" id="text-org6c7390d">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(global-display-line-numbers-mode 1)
(<span style="font-weight: bold;">setq</span> display-line-numbers-type 'relative) 

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Define a list of modes where line numbers should be disabled
</span>(<span style="font-weight: bold;">defvar</span> <span style="font-weight: bold; font-style: italic;">etbcf/disable-line-numbers-modes</span>
  '(org-mode
    term-mode
    eshell-mode
    vterm-mode
    treemacs-mode
    text-mode
    shell-mode
    dired-mode
    mu4e-main-mode
    mu4e-headers-mode
    mu4e-view-mode
    bongo-playlist-mode
    elfeed-search-mode
    elfeed-show-mode)
  <span style="font-style: italic;">"Modes where `display-line-numbers-mode` should be turned off."</span>)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Function to disable line numbers in those modes
</span>(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">etbcf/disable-line-numbers</span> ()
  <span style="font-style: italic;">"Disable line numbers in selected major modes."</span>
  (<span style="font-weight: bold;">when</span> (member major-mode etbcf/disable-line-numbers-modes)
    (display-line-numbers-mode 0)))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Hook the function into major mode changes
</span>(add-hook 'after-change-major-mode-hook #'etbcf/disable-line-numbers)

</pre>
</div>
</div>
</div>
<div id="outline-container-org410418c" class="outline-2">
<h2 id="org410418c">ibuffer</h2>
<div class="outline-text-2" id="text-org410418c">
<p>
Pedi emprestada ao Mike Zamansky esta configuração do ibuffer.
<a href="https://www.youtube.com/playlist?list=PL9KxKa8NpFxIcNQa9js7dQQIHc81b0-Xg">Serie de vídeos no YouTube do Mike Zamansky acerca do Emacs.</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(global-set-key (kbd <span style="font-style: italic;">"C-c i"</span>) 'ibuffer)

  (<span style="font-weight: bold;">setq</span> ibuffer-saved-filter-groups
        (<span style="font-weight: bold;">quote</span> ((<span style="font-style: italic;">"default"</span>
                 (<span style="font-style: italic;">"text"</span> (mode . text-mode))
                 (<span style="font-style: italic;">"dired"</span> (mode . dired-mode))
                 (<span style="font-style: italic;">"org"</span> (name . <span style="font-style: italic;">"^.*org$"</span>))

                 (<span style="font-style: italic;">"web"</span> (<span style="font-weight: bold;">or</span> (mode . web-mode) (mode . js2-mode)))
                 (<span style="font-style: italic;">"shell"</span> (<span style="font-weight: bold;">or</span> (mode . eshell-mode) (mode . shell-mode)))
                 (<span style="font-style: italic;">"mu4e"</span> (name . <span style="font-style: italic;">"</span><span style="font-weight: bold; font-style: italic;">\</span><span style="font-style: italic;">*mu4e</span><span style="font-weight: bold; font-style: italic;">\</span><span style="font-style: italic;">*"</span>))
                 (<span style="font-style: italic;">"programming"</span> (<span style="font-weight: bold;">or</span>
                                 (mode . python-mode)
                                 (mode . c++-mode)
                                 (mode . sh-mode)))
                 (<span style="font-style: italic;">"emacs"</span> (<span style="font-weight: bold;">or</span>
                           (name . <span style="font-style: italic;">"^\\*scratch\\*$"</span>)
                           (name . <span style="font-style: italic;">"^\\*messages\\*$"</span>)))
                 ))))

  (add-hook 'ibuffer-mode-hook
            (<span style="font-weight: bold;">lambda</span> ()
              (ibuffer-auto-mode 1)
              (ibuffer-switch-to-saved-filter-groups <span style="font-style: italic;">"default"</span>)))

</pre>
</div>
</div>
</div>
<div id="outline-container-orgbf4efa8" class="outline-2">
<h2 id="orgbf4efa8">Which key</h2>
<div class="outline-text-2" id="text-orgbf4efa8">
<p>
Ajuda a encontrar comandos.
O repositório pode ser encontrado na seguinte hiperligação <a href="https://github.com/justbur/emacs-which-key">which-key</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> which-key

  <span style="font-weight: bold;">:defer</span> 0
  <span style="font-weight: bold;">:init</span>
  <span style="font-weight: bold;">:diminish</span> which-key-mode
  <span style="font-weight: bold;">:config</span>
  (which-key-mode)
  (<span style="font-weight: bold;">setq</span> which-key-idle-delay 2))

</pre>
</div>
</div>
</div>
<div id="outline-container-org2445b95" class="outline-2">
<h2 id="org2445b95">Diminish</h2>
<div class="outline-text-2" id="text-org2445b95">
<p>
Torna o mode line do Emacs mais limpo retirando o as abreviações dos diferentes modos.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> diminish)

</pre>
</div>
</div>
</div>
<div id="outline-container-orgf2aced4" class="outline-2">
<h2 id="orgf2aced4">Verico, marginalia, consult, orderless and embark</h2>
<div class="outline-text-2" id="text-orgf2aced4">
</div>
