docs/dotemacs.html
<div id="outline-container-orgece86f9" class="outline-3">
<h3 id="orgece86f9">Configuração básica</h3>
<div class="outline-text-3" id="text-orgece86f9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">The `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">vertico</span><span style="font-weight: bold; font-style: italic;">' package applies a vertical layout to the minibuffer.
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">It also pops up the minibuffer eagerly so we can see the available
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">options without further interactions.  This package is very fast
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">and "just works", though it also is highly customisable in case we
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">need to modify its behaviour.
</span><span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Further reading: https://protesilaos.com/emacs/dotemacs#h:cff33514-d3ac-4c16-a889-ea39d7346dc5
</span>(<span style="font-weight: bold;">use-package</span> vertico
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> vertico-cycle t)
  (<span style="font-weight: bold;">setq</span> vertico-resize nil)
  (vertico-mode 1))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">The `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">marginalia</span><span style="font-weight: bold; font-style: italic;">' package provides helpful annotations next to
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">completion candidates in the minibuffer.  The information on
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">display depends on the type of content.  If it is about files, it
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">shows file permissions and the last modified date.  If it is a
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">buffer, it shows the buffer's size, major mode, and the like.
</span><span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Further reading: https://protesilaos.com/emacs/dotemacs#h:bd3f7a1d-a53d-4d3e-860e-25c5b35d8e7e
</span>(<span style="font-weight: bold;">use-package</span> marginalia
  <span style="font-weight: bold;">:config</span>
  (marginalia-mode 1))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">The `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">orderless</span><span style="font-weight: bold; font-style: italic;">' package lets the minibuffer use an out-of-order
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">pattern matching algorithm.  It matches space-separated words or
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">regular expressions in any order.  In its simplest form, something
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">like "ins pac" matches `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">package-menu-mark-install</span><span style="font-weight: bold; font-style: italic;">' as well as
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">`</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">package-install</span><span style="font-weight: bold; font-style: italic;">'.  This is a powerful tool because we no longer
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">need to remember exactly how something is named.
</span><span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Note that Emacs has lots of "completion styles" (pattern matching
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">algorithms), but let us keep things simple.
</span><span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Further reading: https://protesilaos.com/emacs/dotemacs#h:7cc77fd0-8f98-4fc0-80be-48a758fcb6e2
</span>(<span style="font-weight: bold;">use-package</span> orderless
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> completion-styles '(orderless basic)))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">The `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">consult</span><span style="font-weight: bold; font-style: italic;">' package provides lots of commands that are enhanced
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">variants of basic, built-in functionality.  One of the headline
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">features of `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">consult</span><span style="font-weight: bold; font-style: italic;">' is its preview facility, where it shows in
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">another Emacs window the context of what is currently matched in
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">the minibuffer.  Here I define key bindings for some commands you
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">may find useful.  The mnemonic for their prefix is "alternative
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">search" (as opposed to the basic C-s or C-r keys).
</span><span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Further reading: https://protesilaos.com/emacs/dotemacs#h:22e97b4c-d88d-4deb-9ab3-f80631f9ff1d
</span>(<span style="font-weight: bold;">use-package</span> consult

  <span style="font-weight: bold;">:bind</span> (<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">A recursive grep
</span>         (<span style="font-style: italic;">"M-s M-g"</span> . consult-grep)
         <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Search for files names recursively
</span>         (<span style="font-style: italic;">"M-s M-f"</span> . consult-find)
         <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Search through the outline (headings) of the file
</span>         (<span style="font-style: italic;">"M-s M-o"</span> . consult-outline)
         <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Search the current buffer
</span>         (<span style="font-style: italic;">"M-s M-l"</span> . consult-line)
         <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Switch to another buffer, or bookmarked file, or recently
</span>         <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">opened file.
</span>         (<span style="font-style: italic;">"M-s M-b"</span> . consult-buffer)))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">The `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">embark</span><span style="font-weight: bold; font-style: italic;">' package lets you target the thing or context at point
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">and select an action to perform on it.  Use the `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">embark-act</span><span style="font-weight: bold; font-style: italic;">'
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">command while over something to find relevant commands.
</span><span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">When inside the minibuffer, `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">embark</span><span style="font-weight: bold; font-style: italic;">' can collect/export the
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">contents to a fully fledged Emacs buffer.  The `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">embark-collect</span><span style="font-weight: bold; font-style: italic;">'
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">command retains the original behaviour of the minibuffer, meaning
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">that if you navigate over the candidate at hit RET, it will do what
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">the minibuffer would have done.  In contrast, the `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">embark-export</span><span style="font-weight: bold; font-style: italic;">'
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">command reads the metadata to figure out what category this is and
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">places them in a buffer whose major mode is specialised for that
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">type of content.  For example, when we are completing against
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">files, the export will take us to a `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">dired-mode</span><span style="font-weight: bold; font-style: italic;">' buffer; when we
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">preview the results of a grep, the export will put us in a
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">`</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">grep-mode</span><span style="font-weight: bold; font-style: italic;">' buffer.
</span><span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Further reading: https://protesilaos.com/emacs/dotemacs#h:61863da4-8739-42ae-a30f-6e9d686e1995
</span>(<span style="font-weight: bold;">use-package</span> embark
  <span style="font-weight: bold;">:bind</span> ((<span style="font-style: italic;">"C-."</span> . embark-act)
         <span style="font-weight: bold;">:map</span> minibuffer-local-map
         (<span style="font-style: italic;">"C-c C-c"</span> . embark-collect)
         (<span style="font-style: italic;">"C-c C-e"</span> . embark-export)))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">The `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">embark-consult</span><span style="font-weight: bold; font-style: italic;">' package is glue code to tie together `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">embark</span><span style="font-weight: bold; font-style: italic;">'
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">and `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">consult</span><span style="font-weight: bold; font-style: italic;">'.
</span>(<span style="font-weight: bold;">use-package</span> embark-consult)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">The `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">wgrep</span><span style="font-weight: bold; font-style: italic;">' packages lets us edit the results of a grep search
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">while inside a `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">grep-mode</span><span style="font-weight: bold; font-style: italic;">' buffer.  All we need is to toggle the
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">editable mode, make the changes, and then type C-c C-c to confirm
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">or C-c C-k to abort.
</span><span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Further reading: https://protesilaos.com/emacs/dotemacs#h:9a3581df-ab18-4266-815e-2edd7f7e4852
</span>(<span style="font-weight: bold;">use-package</span> wgrep
  <span style="font-weight: bold;">:bind</span> ( <span style="font-weight: bold;">:map</span> grep-mode-map
          (<span style="font-style: italic;">"e"</span> . wgrep-change-to-wgrep-mode)
          (<span style="font-style: italic;">"C-x C-q"</span> . wgrep-change-to-wgrep-mode)
          (<span style="font-style: italic;">"C-c C-c"</span> . wgrep-finish-edit)))

</pre>
</div>
</div>
</div>
</div>
