content/dotemacs.org
* Org

** Configuração básica

Ajuda a instilar um novo hábito

#+begin_src emacs-lisp

      (setq org-agenda-files
            '("~/Dropbox/Ficheiros-Org/Habitos.org"
  	    "~/Seagate/Org/Habitos/Segundo-Passo.org"))

      (require 'org-habit)
      (add-to-list 'org-modules 'org-habit)
      (setq org-habit-graph-column 60)

#+end_src

** Configurar linguagens babel

#+begin_src emacs-lisp

  (with-eval-after-load 'org
      (org-babel-do-load-languages
       'org-babel-load-languages
       '((emacs-lisp . t)
         (python . t)
         (shell . t))))

#+end_src

** Modelos struturados

Facilita a criação de blocos de código no modo Org

#+begin_src emacs-lisp

  (with-eval-after-load 'org

      (require 'org-tempo)

      (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
      (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
      (add-to-list 'org-structure-template-alist '("py" . "src python")))

  ;; correção para fechamento de pares no Org mode
  (add-hook 'org-mode-hook (lambda ()
             (setq-local electric-pair-inhibit-predicate
                     `(lambda (c)
                    (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c))))))

#+end_src

** Indentação

#+begin_src emacs-lisp

  (add-hook 'org-mode-hook 'org-indent-mode)

#+end_src

* Ir para a última modificação

#+begin_src emacs-lisp

  (use-package goto-last-change
      :bind ("C-;" . goto-last-change))

#+end_src

* Funções para abrir uma nova linha em cima, em baixo e indentar corretamente

Estas funções foram encontradas no Emacs-Wiki, mas parece que o sítio já não existe.

** Abrir uma linha em cima e em baixo e colocar o cursor no lugar correto.

#+begin_src emacs-lisp

  (defun etbcf/abre-linha-em-cima ()
    "Insere uma linha indentada acima da linha atual."
    (interactive)
    (beginning-of-line)
    (open-line 1)
    (indent-according-to-mode))

  (defun etbcf/abre-linha-em-baixo ()
    "Insere uma nova linha indentada abaixo da linha atual."
    (interactive)

    (move-end-of-line nil)
    (newline-and-indent))

  ;; atalhos para as funções em cima
  (global-set-key (kbd "C-S-o") 'etbcf/abre-linha-em-cima)
  (global-set-key (kbd "C-o") 'etbcf/abre-linha-em-baixo)
  
#+end_src

** Função para criar um novo buffer

#+begin_src emacs-lisp

  ;; (defun debmx-new-buffer ()
  ;;   "Cria um novo buffer `sem nome'."
  ;;   (interactive)
  ;;   (let ((debmx/buf (generate-new-buffer "sem-nome")))
  ;;     (switch-to-buffer debmx/buf)
  ;;     (funcall initial-major-mode)
  ;;     (setq buffer-offer-save t)
  ;;     debmx/buf))
  ;; ;; Modo inicial
  ;; (setq initial-major-mode 'prog-mode)
  ;; (setq initial-buffer-choice 'debmx-new-buffer)

#+end_src

** Função para dar feedback ao copiar

#+begin_src emacs-lisp

    (require 'pulse)

    (defun my/copy-dwim ()
      "Copy the active region or the current line, then briefly highlight it."
      (interactive)
      (let ((beg (if (use-region-p)
                     (region-beginning)
                   (line-beginning-position)))
            (end (if (use-region-p)
                     (region-end)
                   (line-beginning-position 2))))
        (kill-ring-save beg end)
        (pulse-momentary-highlight-region beg end)
        (message (if (use-region-p)
                     "Region copied"
                   "Line copied"))))

    (global-set-key (kbd "C-c y") #'my/copy-dwim)

#+end_src

* Alguns programas

** Windmove

Este pacote facilita a movimentação entre janelas.

#+begin_src emacs-lisp

  (global-set-key (kbd "S-<left>") 'windmove-left)
  (global-set-key (kbd "S-<right>") 'windmove-right)
  (global-set-key (kbd "S-<up>") 'windmove-up)
  (global-set-key (kbd "S-<down>") 'windmove-down)

#+end_src

** Buffer-move

Troca os buffers de posição.

#+begin_src emacs-lisp

      (use-package buffer-move
        :bind (("C-S-c <up>" . buf-move-up)
               ("C-S-c <down>" . buf-move-down)
               ("C-S-c <left>" . buf-move-left)
               ("C-S-c <right>" . buf-move-right)))
      
#+end_src

