docs/dotemacs.html
<div id="outline-container-org23858c4" class="outline-2">
<h2 id="org23858c4">Org</h2>
<div class="outline-text-2" id="text-org23858c4">
</div>
<div id="outline-container-org0e679da" class="outline-3">
<h3 id="org0e679da">Configuração básica</h3>
<div class="outline-text-3" id="text-org0e679da">
<p>
Ajuda a instilar um novo hábito
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">setq</span> org-agenda-files
      '(<span style="font-style: italic;">"~/Dropbox/Ficheiros-Org/Habitos.org"</span>
            <span style="font-style: italic;">"~/Seagate/Org/Habitos/Segundo-Passo.org"</span>))

(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">org-habit</span>)
(add-to-list 'org-modules 'org-habit)
(<span style="font-weight: bold;">setq</span> org-habit-graph-column 60)

</pre>
</div>
</div>
</div>
<div id="outline-container-org8f4d73d" class="outline-3">
<h3 id="org8f4d73d">Configurar linguagens babel</h3>
<div class="outline-text-3" id="text-org8f4d73d">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">with-eval-after-load</span> 'org
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (python . t)
       (shell . t))))

</pre>
</div>
</div>
</div>
<div id="outline-container-org014482f" class="outline-3">
<h3 id="org014482f">Modelos struturados</h3>
<div class="outline-text-3" id="text-org014482f">
<p>
Facilita a criação de blocos de código no modo Org
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">with-eval-after-load</span> 'org

    (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">org-tempo</span>)

    (add-to-list 'org-structure-template-alist '(<span style="font-style: italic;">"sh"</span> . <span style="font-style: italic;">"src shell"</span>))
    (add-to-list 'org-structure-template-alist '(<span style="font-style: italic;">"el"</span> . <span style="font-style: italic;">"src emacs-lisp"</span>))
    (add-to-list 'org-structure-template-alist '(<span style="font-style: italic;">"py"</span> . <span style="font-style: italic;">"src python"</span>)))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">corre&#231;&#227;o para fechamento de pares no Org mode
</span>(add-hook 'org-mode-hook (<span style="font-weight: bold;">lambda</span> ()
           (<span style="font-weight: bold;">setq-local</span> electric-pair-inhibit-predicate
                   `(<span style="font-weight: bold;">lambda</span> (c)
                  (<span style="font-weight: bold;">if</span> (char-equal c ?&lt;) t (,electric-pair-inhibit-predicate c))))))

</pre>
</div>
</div>
</div>
<div id="outline-container-org921c2d2" class="outline-3">
<h3 id="org921c2d2">Indentação</h3>
<div class="outline-text-3" id="text-org921c2d2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(add-hook 'org-mode-hook 'org-indent-mode)

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd2d29ce" class="outline-2">
<h2 id="orgd2d29ce">Ir para a última modificação</h2>
<div class="outline-text-2" id="text-orgd2d29ce">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> goto-last-change
    <span style="font-weight: bold;">:bind</span> (<span style="font-style: italic;">"C-;"</span> . goto-last-change))

</pre>
</div>
</div>
</div>
<div id="outline-container-org066befb" class="outline-2">
<h2 id="org066befb">Funções para abrir uma nova linha em cima, em baixo e indentar corretamente</h2>
<div class="outline-text-2" id="text-org066befb">
<p>
Estas funções foram encontradas no Emacs-Wiki, mas parece que o sítio já não existe.
</p>
</div>
<div id="outline-container-org1f1a08a" class="outline-3">
<h3 id="org1f1a08a">Abrir uma linha em cima e em baixo e colocar o cursor no lugar correto.</h3>
<div class="outline-text-3" id="text-org1f1a08a">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">etbcf/abre-linha-em-cima</span> ()
  <span style="font-style: italic;">"Insere uma linha indentada acima da linha atual."</span>
  (<span style="font-weight: bold;">interactive</span>)
  (beginning-of-line)
  (open-line 1)
  (indent-according-to-mode))

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">etbcf/abre-linha-em-baixo</span> ()
  <span style="font-style: italic;">"Insere uma nova linha indentada abaixo da linha atual."</span>
  (<span style="font-weight: bold;">interactive</span>)

  (move-end-of-line nil)
  (newline-and-indent))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">atalhos para as fun&#231;&#245;es em cima
</span>(global-set-key (kbd <span style="font-style: italic;">"C-S-o"</span>) 'etbcf/abre-linha-em-cima)
(global-set-key (kbd <span style="font-style: italic;">"C-o"</span>) 'etbcf/abre-linha-em-baixo)

</pre>
</div>
</div>
</div>
<div id="outline-container-orgef8e0cb" class="outline-3">
<h3 id="orgef8e0cb">Função para criar um novo buffer</h3>
<div class="outline-text-3" id="text-orgef8e0cb">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(defun debmx-new-buffer ()
</span><span style="font-weight: bold; font-style: italic;">;;   </span><span style="font-weight: bold; font-style: italic;">"Cria um novo buffer `sem nome'."
</span><span style="font-weight: bold; font-style: italic;">;;   </span><span style="font-weight: bold; font-style: italic;">(interactive)
</span><span style="font-weight: bold; font-style: italic;">;;   </span><span style="font-weight: bold; font-style: italic;">(let ((debmx/buf (generate-new-buffer "sem-nome")))
</span><span style="font-weight: bold; font-style: italic;">;;     </span><span style="font-weight: bold; font-style: italic;">(switch-to-buffer debmx/buf)
</span><span style="font-weight: bold; font-style: italic;">;;     </span><span style="font-weight: bold; font-style: italic;">(funcall initial-major-mode)
</span><span style="font-weight: bold; font-style: italic;">;;     </span><span style="font-weight: bold; font-style: italic;">(setq buffer-offer-save t)
</span><span style="font-weight: bold; font-style: italic;">;;     </span><span style="font-weight: bold; font-style: italic;">debmx/buf))
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">;; Modo inicial
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(setq initial-major-mode 'prog-mode)
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(setq initial-buffer-choice 'debmx-new-buffer)
</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org75eaaad" class="outline-3">
<h3 id="org75eaaad">Função para dar feedback ao copiar</h3>
<div class="outline-text-3" id="text-org75eaaad">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">pulse</span>)

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my/copy-dwim</span> ()
  <span style="font-style: italic;">"Copy the active region or the current line, then briefly highlight it."</span>
  (<span style="font-weight: bold;">interactive</span>)
  (<span style="font-weight: bold;">let</span> ((beg (<span style="font-weight: bold;">if</span> (use-region-p)
                 (region-beginning)
               (line-beginning-position)))
        (end (<span style="font-weight: bold;">if</span> (use-region-p)
                 (region-end)
               (line-beginning-position 2))))
    (kill-ring-save beg end)
    (pulse-momentary-highlight-region beg end)
    (message (<span style="font-weight: bold;">if</span> (use-region-p)
                 <span style="font-style: italic;">"Region copied"</span>
               <span style="font-style: italic;">"Line copied"</span>))))

(global-set-key (kbd <span style="font-style: italic;">"C-c y"</span>) #'my/copy-dwim)

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org0797d1e" class="outline-2">
<h2 id="org0797d1e">Alguns programas</h2>
<div class="outline-text-2" id="text-org0797d1e">
</div>
<div id="outline-container-org38d3e0c" class="outline-3">
<h3 id="org38d3e0c">Windmove</h3>
<div class="outline-text-3" id="text-org38d3e0c">
<p>
Este pacote facilita a movimentação entre janelas.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(global-set-key (kbd <span style="font-style: italic;">"S-&lt;left&gt;"</span>) 'windmove-left)
(global-set-key (kbd <span style="font-style: italic;">"S-&lt;right&gt;"</span>) 'windmove-right)
(global-set-key (kbd <span style="font-style: italic;">"S-&lt;up&gt;"</span>) 'windmove-up)
(global-set-key (kbd <span style="font-style: italic;">"S-&lt;down&gt;"</span>) 'windmove-down)

</pre>
</div>
</div>
</div>
<div id="outline-container-orgb7e7aee" class="outline-3">
<h3 id="orgb7e7aee">Buffer-move</h3>
<div class="outline-text-3" id="text-orgb7e7aee">
<p>
Troca os buffers de posição.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> buffer-move
  <span style="font-weight: bold;">:bind</span> ((<span style="font-style: italic;">"C-S-c &lt;up&gt;"</span> . buf-move-up)
         (<span style="font-style: italic;">"C-S-c &lt;down&gt;"</span> . buf-move-down)
         (<span style="font-style: italic;">"C-S-c &lt;left&gt;"</span> . buf-move-left)
         (<span style="font-style: italic;">"C-S-c &lt;right&gt;"</span> . buf-move-right)))

</pre>
</div>
</div>
</div>
