content/dotemacs.org
** Cursores múltiplos

#+begin_src emacs-lisp

  (use-package multiple-cursors
    :bind
    (("C->" . mc/mark-next-like-this)
     ("C-<" . mc/mark-previous-like-this)
     ("C-c C-a" . mc/mark-all-like-this)
     ("C-S-c C-S-c" . mc/edit-lines))

    :config
    ;; ESSENCIAL: garante comportamento correto de edição
    (delete-selection-mode 1)

    ;; evita conflitos de mouse
    (setq mouse-drag-copy-region nil)

    ;; mostra estado no mode-line
    (setq mc/mode-line t)

    ;; clique com rato (versão estável)
    (global-set-key (kbd "M-<mouse-1>") #'mc/add-cursor-on-click)

    ;; importante: força carregamento correto
    (require 'multiple-cursors))

#+end_src

* Programação

** Caminho para os executáveis (Importante para o NVM)

#+begin_src emacs-lisp
  (use-package exec-path-from-shell
    :config
    (exec-path-from-shell-initialize)
    (exec-path-from-shell-copy-env "XDG_DOCUMENTS_DIR"))
#+end_src

** LSP para Python e Bash

#+begin_src emacs-lisp

  (use-package lsp-mode
    :commands (lsp lsp-deferred)

    :init
    (setq lsp-keymap-prefix "C-c l")

    :hook
    ((python-mode . lsp-deferred)
     (sh-mode . lsp-deferred)
     (web-mode . lsp-deferred)
     (css-ts-mode . lsp-deferred)
     (js-ts-mode . lsp-deferred)
     (typescript-ts-mode . lsp-deferred)
     (tsx-ts-mode . lsp-deferred))

    :config
    (lsp-enable-which-key-integration t)
    (setq lsp-auto-guess-root t
          lsp-idle-delay 0.5))

#+end_src

** Web development

#+begin_src emacs-lisp

  (use-package web-mode
    :mode (("\\.html?\\'" . web-mode)
           ("\\.jsx\\'" . web-mode))
    :hook (web-mode . lsp-deferred)
    :config
    (setq web-mode-enable-auto-quoting nil
          web-mode-markup-indent-offset 2
          web-mode-code-indent-offset 2
          web-mode-css-indent-offset 2))

  (use-package js
    :ensure nil)

  (use-package css-mode
    :ensure nil)

#+end_src

** Emmet

#+begin_src emacs-lisp

  (use-package emmet-mode
    :hook ((web-mode
            css-ts-mode
            js-ts-mode
            tsx-ts-mode)
           . emmet-mode))
#+end_src

** Apheleia

Formatador de código para Python e Bash.

#+begin_src emacs-lisp

  (use-package apheleia
    :diminish apheleia-mode
    :config
    (apheleia-global-mode +1)

    ;; Python → Ruff
    (setf (alist-get 'python-mode apheleia-mode-alist)
          'ruff)

    ;; Bash → shfmt
    (setf (alist-get 'sh-mode apheleia-mode-alist)
          'shfmt))

  (with-eval-after-load 'apheleia
    (setf (alist-get 'web-mode apheleia-mode-alist) 'prettier)
    (setf (alist-get 'css-ts-mode apheleia-mode-alist) 'prettier)
    (setf (alist-get 'js-ts-mode apheleia-mode-alist) 'prettier)
    (setf (alist-get 'typescript-ts-mode apheleia-mode-alist) 'prettier))
    
#+end_src

** Rainbow delimiters

Este pacote facilita a identificação de qual parêntese fecha qual ao aplicar coloração nos mesmos.

#+begin_src emacs-lisp

  (use-package rainbow-delimiters
      :hook (prog-mode . rainbow-delimiters-mode))

#+end_src

** Projectile

Gestor de projectos. Só funciona se os projectos estiverem em repositórios Git.

#+begin_src emacs-lisp

  (use-package projectile
    :diminish projectile-mode
    :config (projectile-mode)
    :custom ((projectile-completion-system 'default)) ;; changed from 'ivy
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    ;; NOTA: Define isto na pasta onde os repósitorios Git estão!
    (when (file-directory-p "~/Projects/Code")
      (setq projectile-project-search-path '("~/Projects/Code/progs-python"
                                             "~/Projects/Code/progs-bash"
                                             "~/Projects/Code/progs-elisp")))
    (setq projectile-switch-project-action #'projectile-dired))

#+end_src

** Magit

[[https://magit.vc/][Magit]] é um excelente interface para o Git.

#+begin_src emacs-lisp

  (use-package magit
      :commands magit-status
      :custom
      (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

#+end_src

** Configuração do blamer

#+begin_src emacs-lisp

  (use-package blamer
    :bind (("C-c i" . blamer-mode))
    :custom
    (blamer-idle-time 0.3)
    (blamer-min-offset 70)
    :custom-face
    (blamer-face ((t :foreground "#7a88cf"
                     :background nil
                     :height 100
                     :italic t)))
    :config
    (global-blamer-mode 0))

#+end_src

