docs/dotemacs.html
<div id="outline-container-org5e7a6c9" class="outline-3">
<h3 id="org5e7a6c9">Cursores múltiplos</h3>
<div class="outline-text-3" id="text-org5e7a6c9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> multiple-cursors
  <span style="font-weight: bold;">:bind</span>
  ((<span style="font-style: italic;">"C-&gt;"</span> . mc/mark-next-like-this)
   (<span style="font-style: italic;">"C-&lt;"</span> . mc/mark-previous-like-this)
   (<span style="font-style: italic;">"C-c C-a"</span> . mc/mark-all-like-this)
   (<span style="font-style: italic;">"C-S-c C-S-c"</span> . mc/edit-lines))

  <span style="font-weight: bold;">:config</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">ESSENCIAL: garante comportamento correto de edi&#231;&#227;o
</span>  (delete-selection-mode 1)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">evita conflitos de mouse
</span>  (<span style="font-weight: bold;">setq</span> mouse-drag-copy-region nil)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">mostra estado no mode-line
</span>  (<span style="font-weight: bold;">setq</span> mc/mode-line t)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">clique com rato (vers&#227;o est&#225;vel)
</span>  (global-set-key (kbd <span style="font-style: italic;">"M-&lt;mouse-1&gt;"</span>) #'mc/add-cursor-on-click)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">importante: for&#231;a carregamento correto
</span>  (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">multiple-cursors</span>))

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org5facce3" class="outline-2">
<h2 id="org5facce3">Programação</h2>
<div class="outline-text-2" id="text-org5facce3">
</div>
<div id="outline-container-org793e1ef" class="outline-3">
<h3 id="org793e1ef">Caminho para os executáveis (Importante para o NVM)</h3>
<div class="outline-text-3" id="text-org793e1ef">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">use-package</span> exec-path-from-shell
  <span style="font-weight: bold;">:config</span>
  (exec-path-from-shell-initialize)
  (exec-path-from-shell-copy-env <span style="font-style: italic;">"XDG_DOCUMENTS_DIR"</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc9e6556" class="outline-3">
<h3 id="orgc9e6556">LSP para Python e Bash</h3>
<div class="outline-text-3" id="text-orgc9e6556">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> lsp-mode
  <span style="font-weight: bold;">:commands</span> (lsp lsp-deferred)

  <span style="font-weight: bold;">:init</span>
  (<span style="font-weight: bold;">setq</span> lsp-keymap-prefix <span style="font-style: italic;">"C-c l"</span>)

  <span style="font-weight: bold;">:hook</span>
  ((python-mode . lsp-deferred)
   (sh-mode . lsp-deferred)
   (web-mode . lsp-deferred)
   (css-ts-mode . lsp-deferred)
   (js-ts-mode . lsp-deferred)
   (typescript-ts-mode . lsp-deferred)
   (tsx-ts-mode . lsp-deferred))

  <span style="font-weight: bold;">:config</span>
  (lsp-enable-which-key-integration t)
  (<span style="font-weight: bold;">setq</span> lsp-auto-guess-root t
        lsp-idle-delay 0.5))

</pre>
</div>
</div>
</div>
<div id="outline-container-org266ba40" class="outline-3">
<h3 id="org266ba40">Web development</h3>
<div class="outline-text-3" id="text-org266ba40">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> web-mode
  <span style="font-weight: bold;">:mode</span> ((<span style="font-style: italic;">"\\.html?\\'"</span> . web-mode)
         (<span style="font-style: italic;">"\\.jsx\\'"</span> . web-mode))
  <span style="font-weight: bold;">:hook</span> (web-mode . lsp-deferred)
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> web-mode-enable-auto-quoting nil
        web-mode-markup-indent-offset 2
        web-mode-code-indent-offset 2
        web-mode-css-indent-offset 2))

(<span style="font-weight: bold;">use-package</span> js
  <span style="font-weight: bold;">:ensure</span> nil)

(<span style="font-weight: bold;">use-package</span> css-mode
  <span style="font-weight: bold;">:ensure</span> nil)

</pre>
</div>
</div>
</div>
<div id="outline-container-org78c50ab" class="outline-3">
<h3 id="org78c50ab">Emmet</h3>
<div class="outline-text-3" id="text-org78c50ab">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> emmet-mode
  <span style="font-weight: bold;">:hook</span> ((web-mode
          css-ts-mode
          js-ts-mode
          tsx-ts-mode)
         . emmet-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-org63f53c7" class="outline-3">
<h3 id="org63f53c7">Apheleia</h3>
<div class="outline-text-3" id="text-org63f53c7">
<p>
Formatador de código para Python e Bash.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> apheleia
  <span style="font-weight: bold;">:diminish</span> apheleia-mode
  <span style="font-weight: bold;">:config</span>
  (apheleia-global-mode +1)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Python &#8594; Ruff
</span>  (<span style="font-weight: bold;">setf</span> (alist-get 'python-mode apheleia-mode-alist)
        'ruff)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Bash &#8594; shfmt
</span>  (<span style="font-weight: bold;">setf</span> (alist-get 'sh-mode apheleia-mode-alist)
        'shfmt))

(<span style="font-weight: bold;">with-eval-after-load</span> 'apheleia
  (<span style="font-weight: bold;">setf</span> (alist-get 'web-mode apheleia-mode-alist) 'prettier)
  (<span style="font-weight: bold;">setf</span> (alist-get 'css-ts-mode apheleia-mode-alist) 'prettier)
  (<span style="font-weight: bold;">setf</span> (alist-get 'js-ts-mode apheleia-mode-alist) 'prettier)
  (<span style="font-weight: bold;">setf</span> (alist-get 'typescript-ts-mode apheleia-mode-alist) 'prettier))

</pre>
</div>
</div>
</div>
<div id="outline-container-org7edb6b1" class="outline-3">
<h3 id="org7edb6b1">Rainbow delimiters</h3>
<div class="outline-text-3" id="text-org7edb6b1">
<p>
Este pacote facilita a identificação de qual parêntese fecha qual ao aplicar coloração nos mesmos.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> rainbow-delimiters
    <span style="font-weight: bold;">:hook</span> (prog-mode . rainbow-delimiters-mode))

</pre>
</div>
</div>
</div>
<div id="outline-container-orgf4859b1" class="outline-3">
<h3 id="orgf4859b1">Projectile</h3>
<div class="outline-text-3" id="text-orgf4859b1">
<p>
Gestor de projectos. Só funciona se os projectos estiverem em repositórios Git.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> projectile
  <span style="font-weight: bold;">:diminish</span> projectile-mode
  <span style="font-weight: bold;">:config</span> (projectile-mode)
  <span style="font-weight: bold;">:custom</span> ((projectile-completion-system 'default)) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">changed from 'ivy
</span>  <span style="font-weight: bold;">:bind-keymap</span>
  (<span style="font-style: italic;">"C-c p"</span> . projectile-command-map)
  <span style="font-weight: bold;">:init</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">NOTA: Define isto na pasta onde os rep&#243;sitorios Git est&#227;o!
</span>  (<span style="font-weight: bold;">when</span> (file-directory-p <span style="font-style: italic;">"~/Projects/Code"</span>)
    (<span style="font-weight: bold;">setq</span> projectile-project-search-path '(<span style="font-style: italic;">"~/Projects/Code/progs-python"</span>
                                           <span style="font-style: italic;">"~/Projects/Code/progs-bash"</span>
                                           <span style="font-style: italic;">"~/Projects/Code/progs-elisp"</span>)))
  (<span style="font-weight: bold;">setq</span> projectile-switch-project-action #'projectile-dired))

</pre>
</div>
</div>
</div>
<div id="outline-container-org37b80cd" class="outline-3">
<h3 id="org37b80cd">Magit</h3>
<div class="outline-text-3" id="text-org37b80cd">
<p>
<a href="https://magit.vc/">Magit</a> é um excelente interface para o Git.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> magit
    <span style="font-weight: bold;">:commands</span> magit-status
    <span style="font-weight: bold;">:custom</span>
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

</pre>
</div>
</div>
</div>
<div id="outline-container-orgc61b2a5" class="outline-3">
<h3 id="orgc61b2a5">Configuração do blamer</h3>
<div class="outline-text-3" id="text-orgc61b2a5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> blamer
  <span style="font-weight: bold;">:bind</span> ((<span style="font-style: italic;">"C-c i"</span> . blamer-mode))
  <span style="font-weight: bold;">:custom</span>
  (blamer-idle-time 0.3)
  (blamer-min-offset 70)
  <span style="font-weight: bold;">:custom-face</span>
  (blamer-face ((t <span style="font-weight: bold;">:foreground</span> <span style="font-style: italic;">"#7a88cf"</span>
                   <span style="font-weight: bold;">:background</span> nil
                   <span style="font-weight: bold;">:height</span> 100
                   <span style="font-weight: bold;">:italic</span> t)))
  <span style="font-weight: bold;">:config</span>
  (global-blamer-mode 0))

</pre>
</div>
</div>
</div>
