content/dotemacs.org
** Company

[[https://company-mode.github.io/][Company]] serve para auto-completar, eu uso para código.

[[https://github.com/sebastiencs/company-box][company-box]] realça o visual do company.

#+begin_src emacs-lisp

  (use-package company
    :diminish company-mode
    :config
    (setq company-tooltip-align-annotations t
          company-minimum-prefix-length 1
          company-idle-delay 0.2)
    (global-company-mode 1))

  (use-package company-box
      :diminish company-box-mode
      :hook (company-mode . company-box-mode))

  (use-package company-prescient
      :diminish company-prescient
      :after company
      :config
      (company-prescient-mode 1))

#+end_src

** Flycheck

Este pacote é um linter.

#+begin_src emacs-lisp

  (use-package flycheck
    :init (global-flycheck-mode))

#+end_src

* Terminais

** Term

#+begin_src emacs-lisp

  (use-package term
    :commands term
    :config
    (setq explicit-shell-file-name "bash") ;; muda isto para zsh, etc

    ;; (setq explicit-zsh-args '()) ;; Usa 'explicit-<shell>-args para argumentos específicos do shell

    ;; corresponde ao prompt padrão do Bash. Atualiza isto se tiveres um prompt personalizado
    (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *"))

  (use-package eterm-256color
    :hook (term-mode . eterm-256color-mode))

  (global-set-key (kbd "s-t") #'vterm-other-window)

#+end_src

** vterm

#+begin_src emacs-lisp

  (use-package vterm
    :commands vterm
    :config
    (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")
    (setq vterm-max-scrollback 10000)

    (defun my/vterm-use-nerd-font ()
      (buffer-face-set
       '(:family "IosevkaTerm Nerd Font"
         :height 100)))

    (add-hook 'vterm-mode-hook #'my/vterm-use-nerd-font))

#+end_src

** eshell

#+begin_src emacs-lisp

  (defun etbcf/configure-eshell ()
    ;; guardar histórico de comandos quando são invocados
    (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

    ;; truncar buffer para performance (evita buffers gigantes lentos)
    (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

    ;; abre histórico de comandos com interface Vertico/Consult
    (define-key eshell-mode-map (kbd "C-r") 'consult-history)

    ;; mapear <home> para início lógico da linha no Eshell
    (define-key eshell-mode-map (kbd "<home>") 'eshell-bol)

    ;; configurações de histórico e comportamento
    (setq eshell-history-size 10000
          eshell-buffer-maximuM-lines 10000
          eshell-hist-ignoredups t
          eshell-scroll-to-bottom-on-input t))

  ;; tema de prompt com git no Eshell
  (use-package eshell-git-prompt
    :after eshell)

  (use-package eshell
    :hook (eshell-first-time-mode . etbcf/configure-eshell)
    :config

    (with-eval-after-load 'esh-opt
      ;; matar buffer quando processo termina (limpa automaticamente)
      (setq eshell-destroy-buffer-when-process-dies t)

      ;; comandos que precisam de terminal real (não Eshell puro)
      (setq eshell-visual-commands '("htop" "zsh" "vim")))

    ;; tema do prompt (powerline style com git status)
    (eshell-git-prompt-use-theme 'powerline))
#+end_src

* Gestão de ficheiros

** Dired

#+begin_src emacs-lisp

  (use-package dired
    :ensure nil
    :hook (dired-mode . dired-hide-details-mode)
    :commands (dired dired-jump)

    :bind
    (("C-x C-j" . dired-jump))

    :config

    ;; Listagem de ficheiros mais legível
    (setq dired-listing-switches "-agho --group-directories-first")
    ;; mostra ficheiros ocultos, formato compacto e diretórios primeiro

    ;; Enviar ficheiros para o lixo em vez de apagar diretamente
    (setq delete-by-moving-to-trash t)

    ;; Evitar acumulação de buffers Dired
    (setq dired-kill-when-opening-new-dired-buffer t)

    ;; Operações recursivas sem perguntas repetidas
    (setq dired-recursive-copies 'always
          dired-recursive-deletes 'always)

    ;; Suporte automático a ficheiros comprimidos
    (auto-compression-mode 1))

#+end_src

** Dired async

#+begin_src emacs-lisp

  (use-package async)

  (with-eval-after-load 'dired
    (require 'dired-async)
    (dired-async-mode 1))
  ;; Permite operações de ficheiros em segundo plano sem bloquear o Emacs

#+end_src

