docs/dotemacs.html
<div id="outline-container-org5b581d8" class="outline-3">
<h3 id="org5b581d8">Company</h3>
<div class="outline-text-3" id="text-org5b581d8">
<p>
<a href="https://company-mode.github.io/">Company</a> serve para auto-completar, eu uso para código.
</p>

<p>
<a href="https://github.com/sebastiencs/company-box">company-box</a> realça o visual do company.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> company
  <span style="font-weight: bold;">:diminish</span> company-mode
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> company-tooltip-align-annotations t
        company-minimum-prefix-length 1
        company-idle-delay 0.2)
  (global-company-mode 1))

(<span style="font-weight: bold;">use-package</span> company-box
    <span style="font-weight: bold;">:diminish</span> company-box-mode
    <span style="font-weight: bold;">:hook</span> (company-mode . company-box-mode))

(<span style="font-weight: bold;">use-package</span> company-prescient
    <span style="font-weight: bold;">:diminish</span> company-prescient
    <span style="font-weight: bold;">:after</span> company
    <span style="font-weight: bold;">:config</span>
    (company-prescient-mode 1))

</pre>
</div>
</div>
</div>
<div id="outline-container-orgde38c6a" class="outline-3">
<h3 id="orgde38c6a">Flycheck</h3>
<div class="outline-text-3" id="text-orgde38c6a">
<p>
Este pacote é um linter.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> flycheck
  <span style="font-weight: bold;">:init</span> (global-flycheck-mode))

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgdfbb65e" class="outline-2">
<h2 id="orgdfbb65e">Terminais</h2>
<div class="outline-text-2" id="text-orgdfbb65e">
</div>
<div id="outline-container-org5c41b20" class="outline-3">
<h3 id="org5c41b20">Term</h3>
<div class="outline-text-3" id="text-org5c41b20">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> term
  <span style="font-weight: bold;">:commands</span> term
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> explicit-shell-file-name <span style="font-style: italic;">"bash"</span>) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">muda isto para zsh, etc
</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(setq explicit-zsh-args '()) ;; Usa 'explicit-&lt;shell&gt;-args para argumentos espec&#237;ficos do shell
</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">corresponde ao prompt padr&#227;o do Bash. Atualiza isto se tiveres um prompt personalizado
</span>  (<span style="font-weight: bold;">setq</span> term-prompt-regexp <span style="font-style: italic;">"^[</span><span style="font-style: italic;">^</span><span style="font-style: italic;">#$%&gt;\n]*[#$%&gt;] *"</span>))

(<span style="font-weight: bold;">use-package</span> eterm-256color
  <span style="font-weight: bold;">:hook</span> (term-mode . eterm-256color-mode))

(global-set-key (kbd <span style="font-style: italic;">"s-t"</span>) #'vterm-other-window)

</pre>
</div>
</div>
</div>
<div id="outline-container-org889db0c" class="outline-3">
<h3 id="org889db0c">vterm</h3>
<div class="outline-text-3" id="text-org889db0c">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> vterm
  <span style="font-weight: bold;">:commands</span> vterm
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> term-prompt-regexp <span style="font-style: italic;">"^[</span><span style="font-style: italic;">^</span><span style="font-style: italic;">#$%&gt;\n]*[#$%&gt;] *"</span>)
  (<span style="font-weight: bold;">setq</span> vterm-max-scrollback 10000)

  (<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my/vterm-use-nerd-font</span> ()
    (buffer-face-set
     '(<span style="font-weight: bold;">:family</span> <span style="font-style: italic;">"IosevkaTerm Nerd Font"</span>
       <span style="font-weight: bold;">:height</span> 100)))

  (add-hook 'vterm-mode-hook #'my/vterm-use-nerd-font))

</pre>
</div>
</div>
</div>
<div id="outline-container-orgf4c8ecc" class="outline-3">
<h3 id="orgf4c8ecc">eshell</h3>
<div class="outline-text-3" id="text-orgf4c8ecc">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">etbcf/configure-eshell</span> ()
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">guardar hist&#243;rico de comandos quando s&#227;o invocados
</span>  (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">truncar buffer para performance (evita buffers gigantes lentos)
</span>  (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">abre hist&#243;rico de comandos com interface Vertico/Consult
</span>  (define-key eshell-mode-map (kbd <span style="font-style: italic;">"C-r"</span>) 'consult-history)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">mapear &lt;home&gt; para in&#237;cio l&#243;gico da linha no Eshell
</span>  (define-key eshell-mode-map (kbd <span style="font-style: italic;">"&lt;home&gt;"</span>) 'eshell-bol)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">configura&#231;&#245;es de hist&#243;rico e comportamento
</span>  (<span style="font-weight: bold;">setq</span> eshell-history-size 10000
        eshell-buffer-maximuM-lines 10000
        eshell-hist-ignoredups t
        eshell-scroll-to-bottom-on-input t))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">tema de prompt com git no Eshell
</span>(<span style="font-weight: bold;">use-package</span> eshell-git-prompt
  <span style="font-weight: bold;">:after</span> eshell)

(<span style="font-weight: bold;">use-package</span> eshell
  <span style="font-weight: bold;">:hook</span> (eshell-first-time-mode . etbcf/configure-eshell)
  <span style="font-weight: bold;">:config</span>

  (<span style="font-weight: bold;">with-eval-after-load</span> 'esh-opt
    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">matar buffer quando processo termina (limpa automaticamente)
</span>    (<span style="font-weight: bold;">setq</span> eshell-destroy-buffer-when-process-dies t)

    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">comandos que precisam de terminal real (n&#227;o Eshell puro)
</span>    (<span style="font-weight: bold;">setq</span> eshell-visual-commands '(<span style="font-style: italic;">"htop"</span> <span style="font-style: italic;">"zsh"</span> <span style="font-style: italic;">"vim"</span>)))

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">tema do prompt (powerline style com git status)
</span>  (eshell-git-prompt-use-theme 'powerline))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf0c7d9e" class="outline-2">
<h2 id="orgf0c7d9e">Gestão de ficheiros</h2>
<div class="outline-text-2" id="text-orgf0c7d9e">
</div>
<div id="outline-container-org00549de" class="outline-3">
<h3 id="org00549de">Dired</h3>
<div class="outline-text-3" id="text-org00549de">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> dired
  <span style="font-weight: bold;">:ensure</span> nil
  <span style="font-weight: bold;">:hook</span> (dired-mode . dired-hide-details-mode)
  <span style="font-weight: bold;">:commands</span> (dired dired-jump)

  <span style="font-weight: bold;">:bind</span>
  ((<span style="font-style: italic;">"C-x C-j"</span> . dired-jump))

  <span style="font-weight: bold;">:config</span>

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Listagem de ficheiros mais leg&#237;vel
</span>  (<span style="font-weight: bold;">setq</span> dired-listing-switches <span style="font-style: italic;">"-agho --group-directories-first"</span>)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">mostra ficheiros ocultos, formato compacto e diret&#243;rios primeiro
</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enviar ficheiros para o lixo em vez de apagar diretamente
</span>  (<span style="font-weight: bold;">setq</span> delete-by-moving-to-trash t)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Evitar acumula&#231;&#227;o de buffers Dired
</span>  (<span style="font-weight: bold;">setq</span> dired-kill-when-opening-new-dired-buffer t)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Opera&#231;&#245;es recursivas sem perguntas repetidas
</span>  (<span style="font-weight: bold;">setq</span> dired-recursive-copies 'always
        dired-recursive-deletes 'always)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Suporte autom&#225;tico a ficheiros comprimidos
</span>  (auto-compression-mode 1))

</pre>
</div>
</div>
</div>
<div id="outline-container-orgdf3c1d5" class="outline-3">
<h3 id="orgdf3c1d5">Dired async</h3>
<div class="outline-text-3" id="text-orgdf3c1d5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> async)

(<span style="font-weight: bold;">with-eval-after-load</span> 'dired
  (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">dired-async</span>)
  (dired-async-mode 1))
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Permite opera&#231;&#245;es de ficheiros em segundo plano sem bloquear o Emacs
</span>
</pre>
</div>
</div>
</div>
