content/dotemacs.org
** Peep dired

#+begin_src emacs-lisp

  (use-package peep-dired
    :after dired
    :bind
    (:map dired-mode-map
          ("P" . peep-dired)))
  ;; Permite pré-visualizar ficheiros sem os abrir

#+end_src

** Dired subtree

#+begin_src emacs-lisp

  (use-package dired-subtree
    :after dired
    :bind
    (:map dired-mode-map
          ("<tab>" . dired-subtree-toggle)
          ("<backtab>" . dired-subtree-cycle)))
  ;; Permite expandir diretórios em forma de árvore

#+end_src

** Abrir

#+begin_src emacs-lisp

  (use-package dired
    :ensure nil
    :config

    (setq dired-guess-shell-alist-user
          '(("\\.\\(png\\|jpe?g\\|tiff\\)" "loupe *" "xdg-open")
            ("\\.\\(mp[34]\\|m4a\\|ogg\\|flac\\|webm\\|mkv\\)" "mpv *" "xdg-open")
            (".*" "xdg-open"))))

  (setq dired-dwim-target t)

#+end_src

* Procura

