docs/dotemacs.html
<div id="outline-container-org9833cb1" class="outline-3">
<h3 id="org9833cb1">Peep dired</h3>
<div class="outline-text-3" id="text-org9833cb1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> peep-dired
  <span style="font-weight: bold;">:after</span> dired
  <span style="font-weight: bold;">:bind</span>
  (<span style="font-weight: bold;">:map</span> dired-mode-map
        (<span style="font-style: italic;">"P"</span> . peep-dired)))
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Permite pr&#233;-visualizar ficheiros sem os abrir
</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5cac35e" class="outline-3">
<h3 id="org5cac35e">Dired subtree</h3>
<div class="outline-text-3" id="text-org5cac35e">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> dired-subtree
  <span style="font-weight: bold;">:after</span> dired
  <span style="font-weight: bold;">:bind</span>
  (<span style="font-weight: bold;">:map</span> dired-mode-map
        (<span style="font-style: italic;">"&lt;tab&gt;"</span> . dired-subtree-toggle)
        (<span style="font-style: italic;">"&lt;backtab&gt;"</span> . dired-subtree-cycle)))
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Permite expandir diret&#243;rios em forma de &#225;rvore
</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org764fec4" class="outline-3">
<h3 id="org764fec4">Abrir</h3>
<div class="outline-text-3" id="text-org764fec4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> dired
  <span style="font-weight: bold;">:ensure</span> nil
  <span style="font-weight: bold;">:config</span>

  (<span style="font-weight: bold;">setq</span> dired-guess-shell-alist-user
        '((<span style="font-style: italic;">"\\.</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">(</span><span style="font-style: italic;">png</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">jpe?g</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">tiff</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">)</span><span style="font-style: italic;">"</span> <span style="font-style: italic;">"loupe *"</span> <span style="font-style: italic;">"xdg-open"</span>)
          (<span style="font-style: italic;">"\\.</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">(</span><span style="font-style: italic;">mp[34]</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">m4a</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">ogg</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">flac</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">webm</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">mkv</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">)</span><span style="font-style: italic;">"</span> <span style="font-style: italic;">"mpv *"</span> <span style="font-style: italic;">"xdg-open"</span>)
          (<span style="font-style: italic;">".*"</span> <span style="font-style: italic;">"xdg-open"</span>))))

(<span style="font-weight: bold;">setq</span> dired-dwim-target t)

</pre>
</div>
</div>
</div>
</div>
