content/dotemacs.org
** Melhorias no Isearch

Executa =C-h k C-s= para obter um menu de ajuda /excelente/ com todas as teclas adicionais usadas no =isearch=. Seguem algumas para usar:

| Chave   | Descrição                                      |
|---------+------------------------------------------------|
| C-s C-w | Procurar carácter ou palavra no ponto          |
| M-s .   | Semelhante, mas com correspondência mais ampla |
| M-s o   | Executar `occur` sobre regexp                  |
| M-s h r | Realçar regexp                                 |
| M-s h u | Desfazer o realce                              |
| C-s M-r | Alternar pesquisa por regexp                   |

Na declaração do pacote abaixo, o efeito combinado das variáveis para espaços em branco é um truque útil: escrever um espaço é o mesmo que inserir um wildcard, o que é muito mais útil na prática. *Isto aplica-se às pesquisas normais* (o =C-s= e =C-r= padrão). As funções de regexp mantêm-se intactas. Este comportamento pode ser alternado durante a pesquisa com =M-s SPC= (volta a tratar os espaços como literais).

Agora seguem algumas funções personalizadas. Aqui fica uma visão geral do que entra nesta configuração.

+ Marcar correspondência :: Substitui o comando de marcação padrão após uma pesquisa bem-sucedida. Pode depois ser usado para múltiplos cursores, eliminar a região, etc. Além disso, é sempre possível marcar uma região desde o ponto até à string pesquisada executando =C-x C-x= após uma pesquisa bem-sucedida.

+ Pesquisar região :: Preenche o pedido de pesquisa com o conteúdo da região. Permite selecionar uma palavra ou frase difícil de escrever manualmente e usá-la como pesquisa.

+ Eliminação DWIM :: A biblioteca =iserch+.el= fornece várias melhorias para a função de pesquisa.

+ Extremo oposto :: O isearch coloca o ponto no início ou no fim da correspondência, dependendo da direção da pesquisa. Para palavras simples isto não é problema, porque se pode confirmar a pesquisa usando uma tecla de movimento (por exemplo, ir para o fim da palavra com =M-f=). No entanto, existem correspondências que não respeitam limites de palavra. Nesses casos, mover para o extremo oposto exige vários comandos. Esta função resolve esse problema (associada a =C-RET= durante uma pesquisa bem-sucedida).

A seguinte função substitui o comando de marcação padrão após uma pesquisa bem-sucedida. Pode ser usada para inserir múltiplos cursores, eliminar a região, etc. Além disso, é sempre possível marcar uma região desde o ponto até à string pesquisada com =C-x C-x= após uma pesquisa bem-sucedida.

#+begin_src emacs-lisp

  ;; Definições para o isearch
  (setq search-whitespace-regexp ".*")
  (setq isearch-lax-whitespace t)
  (setq isearch-regexp-lax-whitespace nil)

  (defun prot/isearch-mark-and-exit ()
    "Marca a string atualmente encontrada. Pode ser usada como bloco
  para cadeias mais complexas, como eliminar a região ou usar múltiplos cursores."
    (interactive)
    (push-mark isearch-other-end t 'activate)
    (setq deactivate-mark nil)
    (isearch-done))
  (define-key isearch-mode-map (kbd "C-SPC") 'prot/isearch-mark-and-exit)

#+end_src

A função seguinte preenche o pedido de pesquisa com o conteúdo da região ativa. Permite selecionar uma palavra ou frase difícil de escrever manualmente e usá-la como pesquisa.

#+begin_src emacs-lisp

  (defun stribb/isearch-region (&optional not-regexp no-recursive-edit)
    "Se existir uma região ativa, usa-a como padrão de pesquisa no isearch."
    (interactive "P\np")
    (when (use-region-p)
      (let ((search (buffer-substring-no-properties
                     (region-beginning)
                     (region-end))))
        (message "stribb/ir: %s %d %d" search (region-beginning) (region-end))
        (setq deactivate-mark t)
        (isearch-yank-string search))))

  (advice-add 'isearch-forward-regexp :after 'stribb/isearch-region)
  (advice-add 'isearch-forward :after 'stribb/isearch-region)
  (advice-add 'isearch-backward-regexp :after 'stribb/isearch-region)
  (advice-add 'isearch-backward :after 'stribb/isearch-region)

#+end_src

#+begin_src emacs-lisp

  (defun contrib/isearch-remove-failed-part-or-last-char ()
    "Remove a parte falhada da string de pesquisa ou o último carácter se tiver sucesso.
    Não faz nada se a string de pesquisa estiver vazia."
    (interactive)
    (if (equal isearch-string "")
        (isearch-update)
      (if isearch-success
          (isearch-delete-char)
        (while (isearch-fail-pos)
          (isearch-pop-state)))
      (isearch-update)))
  (define-key isearch-mode-map (kbd "DEL") 'contrib/isearch-remove-failed-part-or-last-char)

#+end_src

#+begin_src emacs-lisp

  (defun etbcf/isearch-done-opposite-end (&optional nopush edit)
    "Termina a pesquisa no extremo oposto da correspondência.
    Particularmente útil quando a correspondência não respeita limites de palavra."
    (interactive)
    (funcall #'isearch-done nopush edit)
    (when isearch-qother-end (goto-char isearch-other-end)))
  (define-key isearch-mode-map (kbd "<C-return>") 'etbcf/isearch-done-opposite-end)

#+end_src

** Redução de espaços em branco

Por defeito, =M-SPC= reduz múltiplos espaços para um único, enquanto =M-\= remove todos os espaços. Existe também =C-x C-o= que é o inverso de =C-o=.

Para os dois primeiros comandos referidos, usa-se =cycle-spacing=: uma invocação deixa um espaço; uma segunda remove todos os espaços; e uma terceira restaura o estado original. Como não tenho uso para a função padrão ligada a =M-o=, transformo-a num atalho para =C-x C-o=.

#+begin_src emacs-lisp

  (global-set-key (kbd "M-SPC") 'cycle-spacing)
  (global-set-key (kbd "M-o") 'delete-blank-lines)

#+end_src

