docs/dotemacs.html
<div id="outline-container-orgd7ed35d" class="outline-2">
<h2 id="orgd7ed35d">Procura</h2>
<div class="outline-text-2" id="text-orgd7ed35d">
</div>
<div id="outline-container-org3c1a046" class="outline-3">
<h3 id="org3c1a046">Melhorias no Isearch</h3>
<div class="outline-text-3" id="text-org3c1a046">
<p>
Executa <code>C-h k C-s</code> para obter um menu de ajuda <i>excelente</i> com todas as teclas adicionais usadas no <code>isearch</code>. Seguem algumas para usar:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Chave</th>
<th scope="col" class="org-left">Descrição</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-s C-w</td>
<td class="org-left">Procurar carácter ou palavra no ponto</td>
</tr>

<tr>
<td class="org-left">M-s .</td>
<td class="org-left">Semelhante, mas com correspondência mais ampla</td>
</tr>

<tr>
<td class="org-left">M-s o</td>
<td class="org-left">Executar `occur` sobre regexp</td>
</tr>

<tr>
<td class="org-left">M-s h r</td>
<td class="org-left">Realçar regexp</td>
</tr>

<tr>
<td class="org-left">M-s h u</td>
<td class="org-left">Desfazer o realce</td>
</tr>

<tr>
<td class="org-left">C-s M-r</td>
<td class="org-left">Alternar pesquisa por regexp</td>
</tr>
</tbody>
</table>

<p>
Na declaração do pacote abaixo, o efeito combinado das variáveis para espaços em branco é um truque útil: escrever um espaço é o mesmo que inserir um wildcard, o que é muito mais útil na prática. <b>Isto aplica-se às pesquisas normais</b> (o <code>C-s</code> e <code>C-r</code> padrão). As funções de regexp mantêm-se intactas. Este comportamento pode ser alternado durante a pesquisa com <code>M-s SPC</code> (volta a tratar os espaços como literais).
</p>

<p>
Agora seguem algumas funções personalizadas. Aqui fica uma visão geral do que entra nesta configuração.
</p>

<dl class="org-dl">
<dt>Marcar correspondência</dt><dd>Substitui o comando de marcação padrão após uma pesquisa bem-sucedida. Pode depois ser usado para múltiplos cursores, eliminar a região, etc. Além disso, é sempre possível marcar uma região desde o ponto até à string pesquisada executando <code>C-x C-x</code> após uma pesquisa bem-sucedida.</dd>

<dt>Pesquisar região</dt><dd>Preenche o pedido de pesquisa com o conteúdo da região. Permite selecionar uma palavra ou frase difícil de escrever manualmente e usá-la como pesquisa.</dd>

<dt>Eliminação DWIM</dt><dd>A biblioteca <code>iserch+.el</code> fornece várias melhorias para a função de pesquisa.</dd>

<dt>Extremo oposto</dt><dd>O isearch coloca o ponto no início ou no fim da correspondência, dependendo da direção da pesquisa. Para palavras simples isto não é problema, porque se pode confirmar a pesquisa usando uma tecla de movimento (por exemplo, ir para o fim da palavra com <code>M-f</code>). No entanto, existem correspondências que não respeitam limites de palavra. Nesses casos, mover para o extremo oposto exige vários comandos. Esta função resolve esse problema (associada a <code>C-RET</code> durante uma pesquisa bem-sucedida).</dd>
</dl>

<p>
A seguinte função substitui o comando de marcação padrão após uma pesquisa bem-sucedida. Pode ser usada para inserir múltiplos cursores, eliminar a região, etc. Além disso, é sempre possível marcar uma região desde o ponto até à string pesquisada com <code>C-x C-x</code> após uma pesquisa bem-sucedida.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Defini&#231;&#245;es para o isearch
</span>(<span style="font-weight: bold;">setq</span> search-whitespace-regexp <span style="font-style: italic;">".*"</span>)
(<span style="font-weight: bold;">setq</span> isearch-lax-whitespace t)
(<span style="font-weight: bold;">setq</span> isearch-regexp-lax-whitespace nil)

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">prot/isearch-mark-and-exit</span> ()
  <span style="font-style: italic;">"Marca a string atualmente encontrada. Pode ser usada como bloco
para cadeias mais complexas, como eliminar a regi&#227;o ou usar m&#250;ltiplos cursores."</span>
  (<span style="font-weight: bold;">interactive</span>)
  (push-mark isearch-other-end t 'activate)
  (<span style="font-weight: bold;">setq</span> deactivate-mark nil)
  (isearch-done))
(define-key isearch-mode-map (kbd <span style="font-style: italic;">"C-SPC"</span>) 'prot/isearch-mark-and-exit)

</pre>
</div>

<p>
A função seguinte preenche o pedido de pesquisa com o conteúdo da região ativa. Permite selecionar uma palavra ou frase difícil de escrever manualmente e usá-la como pesquisa.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">stribb/isearch-region</span> (<span style="font-weight: bold; text-decoration: underline;">&amp;optional</span> not-regexp no-recursive-edit)
  <span style="font-style: italic;">"Se existir uma regi&#227;o ativa, usa-a como padr&#227;o de pesquisa no isearch."</span>
  (<span style="font-weight: bold;">interactive</span> <span style="font-style: italic;">"P\np"</span>)
  (<span style="font-weight: bold;">when</span> (use-region-p)
    (<span style="font-weight: bold;">let</span> ((search (buffer-substring-no-properties
                   (region-beginning)
                   (region-end))))
      (message <span style="font-style: italic;">"stribb/ir: %s %d %d"</span> search (region-beginning) (region-end))
      (<span style="font-weight: bold;">setq</span> deactivate-mark t)
      (isearch-yank-string search))))

(advice-add 'isearch-forward-regexp <span style="font-weight: bold;">:after</span> 'stribb/isearch-region)
(advice-add 'isearch-forward <span style="font-weight: bold;">:after</span> 'stribb/isearch-region)
(advice-add 'isearch-backward-regexp <span style="font-weight: bold;">:after</span> 'stribb/isearch-region)
(advice-add 'isearch-backward <span style="font-weight: bold;">:after</span> 'stribb/isearch-region)

</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">contrib/isearch-remove-failed-part-or-last-char</span> ()
  <span style="font-style: italic;">"Remove a parte falhada da string de pesquisa ou o &#250;ltimo car&#225;cter se tiver sucesso.
  N&#227;o faz nada se a string de pesquisa estiver vazia."</span>
  (<span style="font-weight: bold;">interactive</span>)
  (<span style="font-weight: bold;">if</span> (equal isearch-string <span style="font-style: italic;">""</span>)
      (isearch-update)
    (<span style="font-weight: bold;">if</span> isearch-success
        (isearch-delete-char)
      (<span style="font-weight: bold;">while</span> (isearch-fail-pos)
        (isearch-pop-state)))
    (isearch-update)))
(define-key isearch-mode-map (kbd <span style="font-style: italic;">"DEL"</span>) 'contrib/isearch-remove-failed-part-or-last-char)

</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">etbcf/isearch-done-opposite-end</span> (<span style="font-weight: bold; text-decoration: underline;">&amp;optional</span> nopush edit)
  <span style="font-style: italic;">"Termina a pesquisa no extremo oposto da correspond&#234;ncia.
  Particularmente &#250;til quando a correspond&#234;ncia n&#227;o respeita limites de palavra."</span>
  (<span style="font-weight: bold;">interactive</span>)
  (funcall #'isearch-done nopush edit)
  (<span style="font-weight: bold;">when</span> isearch-qother-end (goto-char isearch-other-end)))
(define-key isearch-mode-map (kbd <span style="font-style: italic;">"&lt;C-return&gt;"</span>) 'etbcf/isearch-done-opposite-end)

</pre>
</div>
</div>
</div>
<div id="outline-container-org05db425" class="outline-3">
<h3 id="org05db425">Redução de espaços em branco</h3>
<div class="outline-text-3" id="text-org05db425">
<p>
Por defeito, <code>M-SPC</code> reduz múltiplos espaços para um único, enquanto <code>M-\</code> remove todos os espaços. Existe também <code>C-x C-o</code> que é o inverso de <code>C-o</code>.
</p>

<p>
Para os dois primeiros comandos referidos, usa-se <code>cycle-spacing</code>: uma invocação deixa um espaço; uma segunda remove todos os espaços; e uma terceira restaura o estado original. Como não tenho uso para a função padrão ligada a <code>M-o</code>, transformo-a num atalho para <code>C-x C-o</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(global-set-key (kbd <span style="font-style: italic;">"M-SPC"</span>) 'cycle-spacing)
(global-set-key (kbd <span style="font-style: italic;">"M-o"</span>) 'delete-blank-lines)

</pre>
</div>
</div>
</div>
