content/dotemacs.org
** Estatísticas

#+begin_src emacs-lisp

  ;; Mostra o número de candidátos a completar no buffer atual.
  ;; Coloca-o antes do prompt, que entretanto pode ser também depois
  (setq isearch-lazy-count t)
  (setq lazy-count-prefix-format "(%s/%s) ")
  (setq lazy-count-suffix-format nil)

  ;; Faz com que o Isearch normal interprete espaços como expressões
  ;; regulares que combinam com qualquer carácter entre as palavras inseridas
  (setq search-whitespace-regexp ".*?")



#+end_src

* Escrita

** Visual-line-e-flyspell-modo

#+begin_src emacs-lisp

  (defun my-enable-visual-line-and-flyspell ()
       "Enable visual-line-mode and flyspell-mode if buffer name ends with '.txt'."
       (when (and (buffer-file-name)
                  (string-suffix-p ".txt" (buffer-file-name)))
          (flyspell-mode 1)))

     (add-hook 'text-mode-hook 'my-enable-visual-line-and-flyspell)

#+end_src

** Margens

#+begin_src emacs-lisp

  (defun my-toggle-margins ()
    "Alterna as margens no buffer atual."
    (interactive)
    (if (or (> left-margin-width 0)
            (> right-margin-width 0))
        (progn
          (setq left-margin-width 0)
          (setq right-margin-width 0))
      (setq left-margin-width 26)
      (setq right-margin-width 26))

    (set-window-buffer (selected-window) (current-buffer))
    (redraw-display))

  (global-set-key [f5] #'my-toggle-margins)
  
#+end_src

** Modo olivetti

#+begin_src emacs-lisp
    
    (use-package olivetti
      :ensure t
      :config
      (setq olivetti-body-width 200)
      (global-set-key [f8] #'olivetti-mode))

#+end_src

** Contagem de palavras

#+begin_src emacs-lisp

  ;; (use-package wc-mode
  ;;   :hook (text-mode . wc-mode))

  (defun etbcf/word-count ()
    "Return the number of words in the current buffer."
    (count-words (point-min) (point-max)))

  (defun etbcf/word-count-string ()
    "Return formatted word count string for text buffers."
    (when (derived-mode-p 'text-mode)
      (format "Words: %d" (etbcf/word-count))))

  (defface etbcf/word-count-face
    '((t
       :inherit mode-line
       :weight bold))
    "Face for the mode line word count.")

  (defun etbcf/update-word-count-face ()
    "Update word count colors to match Modus themes."
    (cond
     ((member 'modus-operandi-deuteranopia custom-enabled-themes)
      (set-face-attribute
       'etbcf/word-count-face nil
       :inherit 'mode-line
       :foreground "#000000"
       :background 'unspecified
       :weight 'bold))

     ((member 'modus-vivendi-deuteranopia custom-enabled-themes)
      (set-face-attribute
       'etbcf/word-count-face nil
       :inherit 'mode-line
       :foreground "#ffffff"
       :background 'unspecified
       :weight 'bold))

     (t
      (set-face-attribute
       'etbcf/word-count-face nil
       :inherit 'mode-line
       :background 'unspecified
       :weight 'bold))))

  (defun etbcf/mode-line-word-count ()
    "Right-aligned word count for the mode line."
    (when (derived-mode-p 'text-mode)
      (let ((text (format " %s " (etbcf/word-count-string))))
        (concat
         (propertize
          " "
          'display
          `((space :align-to (- right ,(length text)))))
         (propertize text 'face 'etbcf/word-count-face)))))

  (setq-default mode-line-format
                (append mode-line-format
                        '((:eval (etbcf/mode-line-word-count)))))

  (advice-add 'load-theme :after
              (lambda (&rest _)
                (etbcf/update-word-count-face)))

  (etbcf/update-word-count-face)
#+end_src

** Dicionário

#+begin_src emacs-lisp

  (setq ispell-program-name "hunspell")
  (setq ispell-dictionary "pt_PT")
  
#+end_src

* denote-journal
** Carregamento do Elisp denote-journal

#+begin_src emacs-lisp

  ;; Make Elisp files in that directory available to the user.
  (add-to-list 'load-path "~/.emacs.d/manual-packages/denote-journal")

#+end_src

