docs/dotemacs.html
<div id="outline-container-org93c1277" class="outline-3">
<h3 id="org93c1277">Estatísticas</h3>
<div class="outline-text-3" id="text-org93c1277">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Mostra o n&#250;mero de candid&#225;tos a completar no buffer atual.
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Coloca-o antes do prompt, que entretanto pode ser tamb&#233;m depois
</span>(<span style="font-weight: bold;">setq</span> isearch-lazy-count t)
(<span style="font-weight: bold;">setq</span> lazy-count-prefix-format <span style="font-style: italic;">"(%s/%s) "</span>)
(<span style="font-weight: bold;">setq</span> lazy-count-suffix-format nil)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Faz com que o Isearch normal interprete espa&#231;os como express&#245;es
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">regulares que combinam com qualquer car&#225;cter entre as palavras inseridas
</span>(<span style="font-weight: bold;">setq</span> search-whitespace-regexp <span style="font-style: italic;">".*?"</span>)



</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org6a5351e" class="outline-2">
<h2 id="org6a5351e">Escrita</h2>
<div class="outline-text-2" id="text-org6a5351e">
</div>
<div id="outline-container-org113e710" class="outline-3">
<h3 id="org113e710">Visual-line-e-flyspell-modo</h3>
<div class="outline-text-3" id="text-org113e710">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my-enable-visual-line-and-flyspell</span> ()
     <span style="font-style: italic;">"Enable visual-line-mode and flyspell-mode if buffer name ends with '</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">.txt</span><span style="font-style: italic;">'."</span>
     (<span style="font-weight: bold;">when</span> (<span style="font-weight: bold;">and</span> (buffer-file-name)
                (string-suffix-p <span style="font-style: italic;">".txt"</span> (buffer-file-name)))
        (flyspell-mode 1)))

   (add-hook 'text-mode-hook 'my-enable-visual-line-and-flyspell)

</pre>
</div>
</div>
</div>
<div id="outline-container-org91b346d" class="outline-3">
<h3 id="org91b346d">Margens</h3>
<div class="outline-text-3" id="text-org91b346d">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my-toggle-margins</span> ()
  <span style="font-style: italic;">"Alterna as margens no buffer atual."</span>
  (<span style="font-weight: bold;">interactive</span>)
  (<span style="font-weight: bold;">if</span> (<span style="font-weight: bold;">or</span> (&gt; left-margin-width 0)
          (&gt; right-margin-width 0))
      (<span style="font-weight: bold;">progn</span>
        (<span style="font-weight: bold;">setq</span> left-margin-width 0)
        (<span style="font-weight: bold;">setq</span> right-margin-width 0))
    (<span style="font-weight: bold;">setq</span> left-margin-width 26)
    (<span style="font-weight: bold;">setq</span> right-margin-width 26))

  (set-window-buffer (selected-window) (current-buffer))
  (redraw-display))

(global-set-key [f5] #'my-toggle-margins)

</pre>
</div>
</div>
</div>
<div id="outline-container-org63a826b" class="outline-3">
<h3 id="org63a826b">Modo olivetti</h3>
<div class="outline-text-3" id="text-org63a826b">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> olivetti
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> olivetti-body-width 200)
  (global-set-key [f8] #'olivetti-mode))

</pre>
</div>
</div>
</div>
<div id="outline-container-org352a1c9" class="outline-3">
<h3 id="org352a1c9">Contagem de palavras</h3>
<div class="outline-text-3" id="text-org352a1c9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(use-package wc-mode
</span><span style="font-weight: bold; font-style: italic;">;;   </span><span style="font-weight: bold; font-style: italic;">:hook (text-mode . wc-mode))
</span>
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">etbcf/word-count</span> ()
  <span style="font-style: italic;">"Return the number of words in the current buffer."</span>
  (count-words (point-min) (point-max)))

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">etbcf/word-count-string</span> ()
  <span style="font-style: italic;">"Return formatted word count string for text buffers."</span>
  (<span style="font-weight: bold;">when</span> (derived-mode-p 'text-mode)
    (format <span style="font-style: italic;">"Words: %d"</span> (etbcf/word-count))))

(<span style="font-weight: bold;">defface</span> <span style="font-weight: bold; font-style: italic;">etbcf/word-count-face</span>
  '((t
     <span style="font-weight: bold;">:inherit</span> mode-line
     <span style="font-weight: bold;">:weight</span> bold))
  <span style="font-style: italic;">"Face for the mode line word count."</span>)

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">etbcf/update-word-count-face</span> ()
  <span style="font-style: italic;">"Update word count colors to match Modus themes."</span>
  (<span style="font-weight: bold;">cond</span>
   ((member 'modus-operandi-deuteranopia custom-enabled-themes)
    (set-face-attribute
     'etbcf/word-count-face nil
     <span style="font-weight: bold;">:inherit</span> 'mode-line
     <span style="font-weight: bold;">:foreground</span> <span style="font-style: italic;">"#000000"</span>
     <span style="font-weight: bold;">:background</span> 'unspecified
     <span style="font-weight: bold;">:weight</span> 'bold))

   ((member 'modus-vivendi-deuteranopia custom-enabled-themes)
    (set-face-attribute
     'etbcf/word-count-face nil
     <span style="font-weight: bold;">:inherit</span> 'mode-line
     <span style="font-weight: bold;">:foreground</span> <span style="font-style: italic;">"#ffffff"</span>
     <span style="font-weight: bold;">:background</span> 'unspecified
     <span style="font-weight: bold;">:weight</span> 'bold))

   (t
    (set-face-attribute
     'etbcf/word-count-face nil
     <span style="font-weight: bold;">:inherit</span> 'mode-line
     <span style="font-weight: bold;">:background</span> 'unspecified
     <span style="font-weight: bold;">:weight</span> 'bold))))

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">etbcf/mode-line-word-count</span> ()
  <span style="font-style: italic;">"Right-aligned word count for the mode line."</span>
  (<span style="font-weight: bold;">when</span> (derived-mode-p 'text-mode)
    (<span style="font-weight: bold;">let</span> ((text (format <span style="font-style: italic;">" %s "</span> (etbcf/word-count-string))))
      (concat
       (propertize
        <span style="font-style: italic;">" "</span>
        'display
        `((space <span style="font-weight: bold;">:align-to</span> (- right ,(length text)))))
       (propertize text 'face 'etbcf/word-count-face)))))

(<span style="font-weight: bold;">setq-default</span> mode-line-format
              (append mode-line-format
                      '((<span style="font-weight: bold;">:eval</span> (etbcf/mode-line-word-count)))))

(advice-add 'load-theme <span style="font-weight: bold;">:after</span>
            (<span style="font-weight: bold;">lambda</span> (<span style="font-weight: bold; text-decoration: underline;">&amp;rest</span> _)
              (etbcf/update-word-count-face)))

(etbcf/update-word-count-face)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgad69b3f" class="outline-3">
<h3 id="orgad69b3f">Dicionário</h3>
<div class="outline-text-3" id="text-orgad69b3f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">setq</span> ispell-program-name <span style="font-style: italic;">"hunspell"</span>)
(<span style="font-weight: bold;">setq</span> ispell-dictionary <span style="font-style: italic;">"pt_PT"</span>)

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc9195dc" class="outline-2">
<h2 id="orgc9195dc">denote-journal</h2>
<div class="outline-text-2" id="text-orgc9195dc">
</div>
<div id="outline-container-orgc145396" class="outline-3">
<h3 id="orgc145396">Carregamento do Elisp denote-journal</h3>
<div class="outline-text-3" id="text-orgc145396">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Make Elisp files in that directory available to the user.
</span>(add-to-list 'load-path <span style="font-style: italic;">"~/.emacs.d/manual-packages/denote-journal"</span>)

</pre>
</div>
</div>
</div>
