content/dotemacs.org
** Configuração do denote-journal

#+begin_src emacs-lisp

  (use-package denote-journal
    ;; Bind those to some key for your convenience.
    :commands ( denote-journal-new-entry
                denote-journal-new-or-existing-entry
                denote-journal-link-or-create-entry )
    :hook (calendar-mode . denote-journal-calendar-mode)
    :config
    ;; Use the "journal" subdirectory of the `denote-directory'.  Set this
    ;; to nil to use the `denote-directory' instead.
    (setq denote-journal-directory
          (expand-file-name "journal" denote-directory))
    ;; Default keyword for new journal entries. It can also be a list of
    ;; strings.
    (setq denote-journal-keyword "journal")
    ;; Read the doc string of `denote-journal-title-format'.
    (setq denote-journal-title-format 'day-date-month-year))

  (add-hook 'calendar-mode-hook #'denote-journal-calendar-mode)

  (setq denote-journal-signature
        (format-time-string "%H:%M"))
#+end_src

* Music

