docs/dotemacs.html
<div id="outline-container-org86e155a" class="outline-3">
<h3 id="org86e155a">Configuração do denote-journal</h3>
<div class="outline-text-3" id="text-org86e155a">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> denote-journal
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Bind those to some key for your convenience.
</span>  <span style="font-weight: bold;">:commands</span> ( denote-journal-new-entry
              denote-journal-new-or-existing-entry
              denote-journal-link-or-create-entry )
  <span style="font-weight: bold;">:hook</span> (calendar-mode . denote-journal-calendar-mode)
  <span style="font-weight: bold;">:config</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use the "journal" subdirectory of the `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">denote-directory</span><span style="font-weight: bold; font-style: italic;">'.  Set this
</span>  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">to nil to use the `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">denote-directory</span><span style="font-weight: bold; font-style: italic;">' instead.
</span>  (<span style="font-weight: bold;">setq</span> denote-journal-directory
        (expand-file-name <span style="font-style: italic;">"journal"</span> denote-directory))
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Default keyword for new journal entries. It can also be a list of
</span>  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">strings.
</span>  (<span style="font-weight: bold;">setq</span> denote-journal-keyword <span style="font-style: italic;">"journal"</span>)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Read the doc string of `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">denote-journal-title-format</span><span style="font-weight: bold; font-style: italic;">'.
</span>  (<span style="font-weight: bold;">setq</span> denote-journal-title-format 'day-date-month-year))

(add-hook 'calendar-mode-hook #'denote-journal-calendar-mode)

(<span style="font-weight: bold;">setq</span> denote-journal-signature
      (format-time-string <span style="font-style: italic;">"%H:%M"</span>))
</pre>
</div>
</div>
</div>
</div>
