docs/dotemacs.html
<div id="outline-container-orgbfa864e" class="outline-2">
<h2 id="orgbfa864e">Music</h2>
<div class="outline-text-2" id="text-orgbfa864e">
</div>
<div id="outline-container-org73e4abd" class="outline-3">
<h3 id="org73e4abd">Bongo</h3>
<div class="outline-text-3" id="text-org73e4abd">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> bongo
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> bongo-default-directory <span style="font-style: italic;">"/media/etbcf/Stuff/Music"</span>)
  (<span style="font-weight: bold;">setq</span> bongo-prefer-library-buffers nil)
  (<span style="font-weight: bold;">setq</span> bongo-insert-whole-directory-trees t)
  (<span style="font-weight: bold;">setq</span> bongo-logo nil)
  (<span style="font-weight: bold;">setq</span> bongo-display-track-icons nil)
  (<span style="font-weight: bold;">setq</span> bongo-display-track-lengths nil)
  (<span style="font-weight: bold;">setq</span> bongo-display-header-icons nil)
  (<span style="font-weight: bold;">setq</span> bongo-display-playback-mode-indicator t)
  (<span style="font-weight: bold;">setq</span> bongo-display-inline-playback-progress t)
  (<span style="font-weight: bold;">setq</span> bongo-join-inserted-tracks nil)
  (<span style="font-weight: bold;">setq</span> bongo-field-separator (propertize <span style="font-style: italic;">" . "</span> 'facee 'shadow))
  (<span style="font-weight: bold;">setq</span> bongo-mark-played-tracks t)
  (<span style="font-weight: bold;">setq</span> bongo-header-line-mode nil)
  (<span style="font-weight: bold;">setq</span> bongo-mode-line-indicator-mode nil)
  (<span style="font-weight: bold;">setq</span> bongo-enabled-backends '(vlc mpv))
  (<span style="font-weight: bold;">setq</span> bongo-vlc-program-name <span style="font-style: italic;">"cvlc"</span>)

  <span style="font-weight: bold; font-style: italic;">;;; </span><span style="font-weight: bold; font-style: italic;">Bongo playlist buffer
</span>  (<span style="font-weight: bold;">defvar</span> <span style="font-weight: bold; font-style: italic;">prot/bongo-playlist-delimiter</span>
    <span style="font-style: italic;">"\n******************************\n\n"</span>
    <span style="font-style: italic;">"Delimiter for inserted items in `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">bongo</span><span style="font-style: italic;">' playlist buffers."</span>)

  (<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">prot/bongo-playlist-section</span> ()
    (bongo-insert-comment-text
     prot/bongo-playlist-delimiter))

  (<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">prot/bongo-playlist-section-previous</span> ()
    <span style="font-style: italic;">"Move to previous `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">bongo</span><span style="font-style: italic;">' playlist custom section delimiter."</span>
    (<span style="font-weight: bold;">interactive</span>)
    (<span style="font-weight: bold;">let</span> ((section <span style="font-style: italic;">"^\\*+$"</span>))
      (<span style="font-weight: bold;">if</span> (<span style="font-weight: bold;">save-excursion</span> (re-search-backward section nil t))
          (<span style="font-weight: bold;">progn</span>
            (goto-char (point-at-bol))
            (re-search-backward section nil t))
        (goto-char (point-min)))))

  (<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">prot/bongo-playlist-section-next</span> ()
  <span style="font-style: italic;">"Move to next `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">bongo</span><span style="font-style: italic;">' playlist custom section delimiter."</span>
  (<span style="font-weight: bold;">interactive</span>)
  (<span style="font-weight: bold;">let</span> ((section <span style="font-style: italic;">"^\\*+$"</span>))
    (<span style="font-weight: bold;">if</span> (re-search-forward section nil t)
        (<span style="font-weight: bold;">progn</span>
          (goto-char (point-at-bol))
          (re-search-forward section nil t))
      (goto-char (point-max)))))

  (<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">prot/bongo-playlist-mark-section</span> ()
    <span style="font-style: italic;">"Mark `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">bongo</span><span style="font-style: italic;">' playlist section, delimited by custom markers.
The marker is `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">prot/bongo-playlist-delimiter</span><span style="font-style: italic;">'."</span>
    (<span style="font-weight: bold;">interactive</span>)
    (<span style="font-weight: bold;">let</span> ((section <span style="font-style: italic;">"^\\*+$"</span>))
      (search-forward-regexp section nil t)
      (push-mark nil t)
      (forward-line -1)
      <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">REVIEW any predicate to replace this `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">save-excursion</span><span style="font-weight: bold; font-style: italic;">'?
</span>      (<span style="font-weight: bold;">if</span> (<span style="font-weight: bold;">save-excursion</span> (re-search-backward section nil t))
          (<span style="font-weight: bold;">progn</span>
            (search-backward-regexp section nil t)
            (forward-line 1))
        (goto-char (point-min)))
      (activate-mark)))

  (<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">prot/bongo/playlist-kill-section</span> ()
    <span style="font-style: italic;">"Kill `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">bongo</span><span style="font-style: italic;">' playlist-section at point.
This operates on a custom delimited section or the buffer. See
`</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">prot/bongo-playlist-kill-section</span><span style="font-style: italic;">'."</span>
    (<span style="font-weight: bold;">interactive</span>)
    (prot/bongo-playlist-mark-section)
    (bongo-kill))

  (<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">prot/bongo-playlist-play-random</span> ()
    <span style="font-style: italic;">"Play random `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">bongo</span><span style="font-style: italic;">' track and determine further conditions."</span>
    (<span style="font-weight: bold;">interactive</span>)
    (<span style="font-weight: bold;">unless</span> (bongo-playlist-buffer)
      (bongo-playlist-buffer))
    (<span style="font-weight: bold;">when</span> (<span style="font-weight: bold;">or</span> (bongo-playlist-buffer-p)
              (bongo-library-buffer-p))
      (<span style="font-weight: bold;">unless</span> (bongo-playing-p)
        (<span style="font-weight: bold;">with-current-buffer</span> (bongo-playlist-buffer)
          (bongo-play-random)
          (bongo-random-playback-mode 1)
          (bongo-recenter)))))

  (<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">prot/bongo-playlist-random-toggle</span> ()
    <span style="font-style: italic;">"Toggle `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">bongo-random-playback-mode</span><span style="font-style: italic;">' in playlist buffers."</span>
    (<span style="font-weight: bold;">interactive</span>)
    (<span style="font-weight: bold;">if</span> (eq bongo-next-action 'bongo-play-random-or-stop)
        (bongo-progressive-playback-mode)
      (bongo-random-playback-mode)))

  (<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">prot/bongo-playlist-reset</span> ()
    <span style="font-style: italic;">"Stop playback and reset `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">bongo</span><span style="font-style: italic;">' playlist marks.
To reset the playlist is to undo the marks produced by non-nil
`</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">bongo-mark-played-tracks</span><span style="font-style: italic;">'."</span>
    (<span style="font-weight: bold;">interactive</span>)
    (<span style="font-weight: bold;">when</span> (bongo-playlist-buffer-p)
      (bongo-stop)
      (bongo-reset-playlist)))

  (<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">prot/bongo-playlist-terminate</span> ()
    <span style="font-style: italic;">"Stop playback and clear entire `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">bongo</span><span style="font-style: italic;">' playlist buffer.
Contrary to the standard `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">bongo-erase-buffer</span><span style="font-style: italic;">', this also removes
the currently-playing track."</span>
    (<span style="font-weight: bold;">interactive</span>)
    (<span style="font-weight: bold;">when</span> (bongo-playlist-buffer-p)
      (bongo-stop)
      (bongo-erase-buffer)))

  (<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">prot/bongo-playlist-insert-playlist-file</span> ()
    <span style="font-style: italic;">"Insert contents of playlist file to a `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">bongo</span><span style="font-style: italic;">' playlist.
Upon insertion, playback starts immediately, in accordance with
`</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">prot/bongo-play-random</span><span style="font-style: italic;">'.

The available options at the completion prompt point to files
that hold filesystem paths of media items. Think of them as
'directories of directories' that mix manually selected media
items.

Also see `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">prot/bong-dired-make-playlist-file</span><span style="font-style: italic;">'."</span>
    (<span style="font-weight: bold;">interactive</span>)
    (<span style="font-weight: bold;">let*</span> ((path <span style="font-style: italic;">"/media/etbcf/Stuff/Music/playlists"</span>)
           (dotless directory-files-no-dot-files-regexp)
           (playlist (mapcar 'abbreviate-file-name
                             (directory-files path nil dotless)))
           (choice (completing-read <span style="font-style: italic;">"Insert playlist: "</span> playlist nil t)))
      (<span style="font-weight: bold;">if</span> (bongo-playlist-buffer-p)
          (<span style="font-weight: bold;">progn</span>
            (<span style="font-weight: bold;">save-excursion</span>
              (goto-char (point-max))
              (bongo-insert-playlist-contents
               (expand-file-name choice path))
              (prot/bongo-playlist-section))
            (prot/bongo-playlist-play-random))
        (<span style="font-weight: bold;">user-error</span> <span style="font-style: italic;">"Not in a `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">bongo</span><span style="font-style: italic;">' playlist buffer"</span>))))

  <span style="font-weight: bold; font-style: italic;">;;; </span><span style="font-weight: bold; font-style: italic;">Bongo + Dired (bongo library buffer)
</span>  (<span style="font-weight: bold;">defmacro</span> <span style="font-weight: bold;">prot/bongo-dired-library</span> (name doc val)
    <span style="font-style: italic;">"Create `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">bongo</span><span style="font-style: italic;">' library function NAME with DOC and VAL."</span>
    `(<span style="font-weight: bold;">defun</span> ,name ()
       ,doc
       (<span style="font-weight: bold;">when</span> (string-match-p <span style="font-style: italic;">"\\`/media/etbcf/Stuff/Music"</span> default-directory)
         (bongo-dired-library-mode ,val))))

  (prot/bongo-dired-library
   prot/bongo-dired-library-enable
   <span style="font-style: italic;">"Set `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">bongo-dired-library-mode</span><span style="font-style: italic;">' when accessing /media/etbcf/Stuff/Music.

Add this to `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">dired-mode-hook</span><span style="font-style: italic;">'. Upon activation, then directory
and all its sub-directories become a valid library buffer for
Bongo, from where we can, among others, add tracks to playlist.
The added benefit is that Dired will continue to behave as
normal, making this a superior alternative to a purpose-specific
library buffer.

Note, though, that will interfere with `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">wdired-mode</span><span style="font-style: italic;">'. See
`</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">prot/bongo-dired-library-disable</span><span style="font-style: italic;">'."</span>
   1)

  (<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">prot/bongo-dired-library-disable</span> ()
    <span style="font-style: italic;">"Add files in a `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">dired</span><span style="font-style: italic;">' buffer to the `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">bongo</span><span style="font-style: italic;">' playlist."</span>
    (<span style="font-weight: bold;">let</span> ((media (dired-get-marked-files)))
      (<span style="font-weight: bold;">with-current-buffer</span> (bongo-playlist-buffer)
        (goto-char (point-max))
        (mapc 'bongo-insert-file media)
        (prot/bongo-playlist-section))
      (<span style="font-weight: bold;">with-current-buffer</span> (bongo-library-buffer)
        (dired-next-line 1))))

  <span style="font-weight: bold; font-style: italic;">;;; </span><span style="font-weight: bold; font-style: italic;">Bongo + Dired (bongo library buffer)
</span>  (<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">prot/bongo-dired-insert-files</span> ()
    <span style="font-style: italic;">"Insert marked files or file at point from `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">dired</span><span style="font-style: italic;">' buffer into Bongo playlist."</span>
    (<span style="font-weight: bold;">interactive</span>)
    (<span style="font-weight: bold;">let</span> ((files (dired-get-marked-files)))
      (<span style="font-weight: bold;">with-current-buffer</span> (bongo-playlist-buffer)
        (goto-char (point-max))
        (mapc #'bongo-insert-file files)
        (prot/bongo-playlist-section))))

  (<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">prot/bongo-dired-insert</span> ()
    <span style="font-style: italic;">"Add `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">dired</span><span style="font-style: italic;">' item at point or marks to `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">bongo</span><span style="font-style: italic;">' playlist.

The playlist is created, if necessary, while some other tweaks
are introduced. See `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">prot/bongo-dired-insert-files</span><span style="font-style: italic;">' as well as
`</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">prot/bongo-playlist-play-random</span><span style="font-style: italic;">'.

Meant to work while inside a `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">dired</span><span style="font-style: italic;">' buffer that doubles as a
library buffer (see `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">prot/bongo-dired-library</span><span style="font-style: italic;">')."</span>
    (<span style="font-weight: bold;">interactive</span>)
    (<span style="font-weight: bold;">when</span> (bongo-library-buffer-p)
      (<span style="font-weight: bold;">unless</span> (bongo-playlist-buffer-p)
        (bongo-playlist-buffer))
      (prot/bongo-dired-insert-files)
      (prot/bongo-playlist-play-random)))

  (<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">prot/bongo-dired-make-playlist-file</span> ()
    <span style="font-style: italic;">"Add `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">dired</span><span style="font-style: italic;">' marked items to playlist file using completion.
These files are meant to reference filesystem paths. They ease
the task of playing media from closely related directory trees,
without having to interfere with the user's directory
structure (e.g. a playlist file '</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">rock</span><span style="font-style: italic;">' can include the paths of
/media/etbcf/Stuff/Music/Scorpions and /media/etbcf/Stuff/Music/Queen).

This works by appending the absolute filesystem path of each item
to the selected playlist file. If no marks are available, the
item at point will be used instead.

Selecting a non-existent file at the prompt will create a new
entry whose name matches user input. Depending on the completion
framework, such as with `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">icomplete-mode</span><span style="font-style: italic;">', this may require a
forced exit (e.g. \\[</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">exit-minibuffer</span><span style="font-style: italic;">] to parse the input without
further questions).
Also see `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">prot/bongo-playlist-insert-playlist-file</span><span style="font-style: italic;">'."</span>
    (<span style="font-weight: bold;">interactive</span>)
    (<span style="font-weight: bold;">let*</span> ((dotless directory-files-no-dot-files-regexp)
           (pldir <span style="font-style: italic;">"/media/etbcf/Stuff/Music/playlists/"</span>)
           (playlists (mapcar 'abbreviate-file-name
                              (directory-files pldir nil dotless)))
           (plname (completing-read <span style="font-style: italic;">"Select playlist: "</span> playlists nil nil))
           (plfile (format <span style="font-style: italic;">"%s%s"</span> pldir plname))
           (media-paths
            (<span style="font-weight: bold;">if</span> (derived-mode-p 'dired-mode)
                (concat
                 (mapconcat #'identity (dired-get-marked-files) <span style="font-style: italic;">"\n"</span>)
                 <span style="font-style: italic;">"\n"</span>)
              (<span style="font-weight: bold;">user-error</span> <span style="font-style: italic;">"Not in a `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">dired</span><span style="font-style: italic;">' buffer"</span>))))
      <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Check for empty playlist name
</span>      (<span style="font-weight: bold;">when</span> (string-empty-p plname)
        (<span style="font-weight: bold;">user-error</span> <span style="font-style: italic;">"No playlist file has been specified"</span>))
      (<span style="font-weight: bold;">unless</span> (file-directory-p pldir)
        (make-directory pldir))
      (<span style="font-weight: bold;">unless</span> (<span style="font-weight: bold;">and</span> (file-exists-p plfile)
                   (file-readable-p plfile)
                   (not (file-directory-p plfile)))
        (make-empty-file plfile))
      (append-to-file media-paths nil plfile)
      (<span style="font-weight: bold;">with-current-buffer</span> (find-file-noselect plfile)
        (delete-duplicate-lines (point-min) (point-max))
        (sort-lines nil (point-min) (point-max))
        (save-buffer)
        (kill-buffer))))

  <span style="font-weight: bold;">:hook</span> ((dired-mode-hook . prot/bongo-dired-library-enable)
         (wdired-mode-hook . prot/bongo-dired-library-disable))
  <span style="font-weight: bold;">:bind</span> ((<span style="font-style: italic;">"&lt;C-XF86AudioPlay&gt;"</span> . bongo-pause/resume)
         (<span style="font-style: italic;">"&lt;C-XF86AudioNext&gt;"</span> . bongo-next)
         (<span style="font-style: italic;">"&lt;C-XF86AudioPrev&gt;"</span> . bongo-previous)
         (<span style="font-style: italic;">"&lt;M-XF86AudioPlay&gt;"</span> . bongo-show)
         (<span style="font-style: italic;">"&lt;S-XF86AudioNext&gt;"</span> . bongo-seek-forward-10)
         (<span style="font-style: italic;">"&lt;S-XF86AudioPrev&gt;"</span> . bongo-seek-backward-10)
         <span style="font-weight: bold;">:map</span> bongo-playlist-mode-map
         (<span style="font-style: italic;">"n"</span> . bongo-next-object)
         (<span style="font-style: italic;">"p"</span> . bongo-previous-object)
         (<span style="font-style: italic;">"M-n"</span> . prot/bongo-playlist-section-next)
         (<span style="font-style: italic;">"M-p"</span> . prot/bongo-playlist-section-previous)
         (<span style="font-style: italic;">"M-h"</span> . prot/bongo-playlist-mark-section)
         (<span style="font-style: italic;">"M-d"</span> . prot/bongo-playlist-kill-section)
         (<span style="font-style: italic;">"g"</span> . prot/bongo-playlist-reset)
         (<span style="font-style: italic;">"D"</span> . prot/bongo-playlist-terminate)
         (<span style="font-style: italic;">"r"</span> . prot/bongo-playlist-random-toggle)
         (<span style="font-style: italic;">"R"</span> . bongo-rename-line)
         (<span style="font-style: italic;">"j"</span> . bongo-dired-line)      <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">Jump to dir of file at point
</span>         (<span style="font-style: italic;">"J"</span> . dired-jump)            <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">Jump to library buffer
</span>         (<span style="font-style: italic;">"i"</span> . prot/bongo-playlist-insert-playlist-file)
         (<span style="font-style: italic;">"I"</span> . bongo-insert-special)
         <span style="font-weight: bold;">:map</span> bongo-dired-library-mode-map
         (<span style="font-style: italic;">"&lt;C-return&gt;"</span> . prot/bongo-dired-insert)
         (<span style="font-style: italic;">"C-c &lt;SPC&gt;"</span> . prot/bongo-dired-insert)
         (<span style="font-style: italic;">"C-c +"</span> . prot/bongo-dired-make-playlist-file)))

</pre>
</div>
</div>
</div>
</div>
