content/dotemacs.org
* Email

** mu4e

=README= Para configurar o email no Emacs, primeiro, instalar =sudo apt install isync=, segundo criar o ficheiro de configuração =.mbsyncrc=, terceiro, =mu init --maildir=~/Mail --my-address=example@gmail.com=, depois =mu index=, a seguir, encriptar a palavra-passe com =echo -n "minha-senha-secreta" | gpg --symmetric --cipher-algo AES256 | base64 > ~/.mailpass.gpg= e instalar o mu4e =sudo apt install mu4e=.

#+begin_src emacs-lisp

  (use-package mu4e
    :ensure nil
    ;; :load-path "/usr/share/emacs/site-lisp/mu4e/"
    ;; :defer 20 ; Wait until 20 seconds after startup
    :config

    ;; This is set to 't' to avoid mail syncing issues when using mbsync
    (setq mu4e-change-filenames-when-moving t)

    ;; Refresh mail using isync every 10 minutes
    (setq mu4e-update-interval (* 10 60))
    (setq mu4e-get-mail-command "mbsync -a")
    (setq mu4e-maildir "~/Mail")

    (setq mu4e-drafts-folder "/[Gmail]/Rascunhos")
    (setq mu4e-sent-folder   "/[Gmail]/Enviado")
    (setq mu4e-refile-folder "/[Gmail]/Todo o correio")
    (setq mu4e-trash-folder  "/[Gmail]/Lixo"))

#+end_src

* Elfeed

** Configuração do elfeed

#+begin_src emacs-lisp

  (use-package elfeed
    :bind ("C-c e" . elfeed)
    :config

    ;; Ativar quebra visual de linhas ao ler artigos
    (add-hook 'elfeed-show-mode-hook #'visual-line-mode)

    ;; Atalhos na lista de artigos
    (define-key elfeed-search-mode-map (kbd "w") #'elfeed-search-yank)
    (define-key elfeed-search-mode-map (kbd "g") #'elfeed-update)
    (define-key elfeed-search-mode-map (kbd "G") #'revert-buffer)

    ;; Atalho dentro do artigo aberto
    (define-key elfeed-show-mode-map (kbd "w") #'elfeed-show-yank)

    ;; Guardar base de dados do Elfeed dentro da pasta do Emacs
    (setq elfeed-db-directory
          (expand-file-name "elfeed/" user-emacs-directory))

    ;; Pasta para downloads de anexos
    (setq elfeed-enclosure-default-dir
          (expand-file-name "~/Downloads/"))

    ;; Mostrar apenas artigos não lidos das últimas 2 semanas
    (setq elfeed-search-filter "@2-weeks-ago +unread")

    ;; Ordenar artigos do mais recente para o mais antigo
    (setq elfeed-sort-order 'descending)

    ;; Usar clipboard do sistema
    (setq elfeed-search-clipboard-type 'CLIPBOARD)

    ;; Ajustes visuais da lista
    (setq elfeed-search-title-max-width 100)
    (setq elfeed-search-title-min-width 30)
    (setq elfeed-search-trailing-width 25)

    ;; Não mostrar URLs enormes por completo
    (setq elfeed-show-truncate-long-urls t)

    ;; Cada artigo aberto recebe o seu próprio buffer
    (setq elfeed-show-unique-buffers t)

    ;; Formato da data
    (setq elfeed-search-date-format
        '("%d-%m-%Y %H:%M" 20 :left))

    ;; Desativar curl externo
    ;; O backend interno costuma ser suficiente
    (setq elfeed-use-curl nil)

    ;; Número máximo de ligações simultâneas
    (setq elfeed-curl-max-connections 10)

    ;; Carregar feeds a partir de ficheiro separado
    ;; O ficheiro deve conter:
    ;;
    ;; (setq elfeed-feeds
    ;;       '(("https://site.com/feed.xml" tag1 tag2)
    ;;         ("https://outro-site.com/rss" linux emacs)))
    ;;
    (unless (bound-and-true-p elfeed-feeds)
      (load "/media/etbcf/Stuff/feeds.el" :no-error :no-message))

    ;; Destacar feeds pessoais
    (add-to-list
     'elfeed-search-face-alist
     '(personal bold-italic)))

#+end_src

* Ativar winner-mode

** Winner-mode

#+begin_src emacs-lisp

  (winner-mode 1)

#+end_src

* Burly

Guardar disposições de janelas, buffers, layouts, posição de cursores e outros

#+begin_src emacs-lisp

  (use-package burly
    :config
    (setq bookmark-save-flag 1)
    (burly-tabs-mode 1)

    :bind
    (("C-c s s" . burly-bookmark-windows)
     ("C-c s f" . burly-bookmark-frames)
     ("C-c s o" . burly-open-bookmark)))

#+end_src

* Modeline

#+begin_src emacs-lisp

  (setq-default
   mode-line-buffer-identification
   '(:eval
     (if buffer-file-name
         (abbreviate-file-name buffer-file-name)
       "%b")))

#+end_src

