docs/dotemacs.html
<div id="outline-container-org8eb4b4e" class="outline-2">
<h2 id="org8eb4b4e">Email</h2>
<div class="outline-text-2" id="text-org8eb4b4e">
</div>
<div id="outline-container-org45418a5" class="outline-3">
<h3 id="org45418a5">mu4e</h3>
<div class="outline-text-3" id="text-org45418a5">
<p>
<code>README</code> Para configurar o email no Emacs, primeiro, instalar <code>sudo apt install isync</code>, segundo criar o ficheiro de configuração <code>.mbsyncrc</code>, terceiro, <code>mu init --maildir=~/Mail --my-address=example@gmail.com</code>, depois <code>mu index</code>, a seguir, encriptar a palavra-passe com <code>echo -n "minha-senha-secreta" | gpg --symmetric --cipher-algo AES256 | base64 &gt; ~/.mailpass.gpg</code> e instalar o mu4e <code>sudo apt install mu4e</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> mu4e
  <span style="font-weight: bold;">:ensure</span> nil
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">:load-path "/usr/share/emacs/site-lisp/mu4e/"
</span>  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">:defer 20 ; Wait until 20 seconds after startup
</span>  <span style="font-weight: bold;">:config</span>

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">This is set to '</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">t</span><span style="font-weight: bold; font-style: italic;">' to avoid mail syncing issues when using mbsync
</span>  (<span style="font-weight: bold;">setq</span> mu4e-change-filenames-when-moving t)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Refresh mail using isync every 10 minutes
</span>  (<span style="font-weight: bold;">setq</span> mu4e-update-interval (* 10 60))
  (<span style="font-weight: bold;">setq</span> mu4e-get-mail-command <span style="font-style: italic;">"mbsync -a"</span>)
  (<span style="font-weight: bold;">setq</span> mu4e-maildir <span style="font-style: italic;">"~/Mail"</span>)

  (<span style="font-weight: bold;">setq</span> mu4e-drafts-folder <span style="font-style: italic;">"/[Gmail]/Rascunhos"</span>)
  (<span style="font-weight: bold;">setq</span> mu4e-sent-folder   <span style="font-style: italic;">"/[Gmail]/Enviado"</span>)
  (<span style="font-weight: bold;">setq</span> mu4e-refile-folder <span style="font-style: italic;">"/[Gmail]/Todo o correio"</span>)
  (<span style="font-weight: bold;">setq</span> mu4e-trash-folder  <span style="font-style: italic;">"/[Gmail]/Lixo"</span>))

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org7bf9d97" class="outline-2">
<h2 id="org7bf9d97">Elfeed</h2>
<div class="outline-text-2" id="text-org7bf9d97">
</div>
<div id="outline-container-org56ef367" class="outline-3">
<h3 id="org56ef367">Configuração do elfeed</h3>
<div class="outline-text-3" id="text-org56ef367">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> elfeed
  <span style="font-weight: bold;">:bind</span> (<span style="font-style: italic;">"C-c e"</span> . elfeed)
  <span style="font-weight: bold;">:config</span>

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Ativar quebra visual de linhas ao ler artigos
</span>  (add-hook 'elfeed-show-mode-hook #'visual-line-mode)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Atalhos na lista de artigos
</span>  (define-key elfeed-search-mode-map (kbd <span style="font-style: italic;">"w"</span>) #'elfeed-search-yank)
  (define-key elfeed-search-mode-map (kbd <span style="font-style: italic;">"g"</span>) #'elfeed-update)
  (define-key elfeed-search-mode-map (kbd <span style="font-style: italic;">"G"</span>) #'revert-buffer)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Atalho dentro do artigo aberto
</span>  (define-key elfeed-show-mode-map (kbd <span style="font-style: italic;">"w"</span>) #'elfeed-show-yank)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Guardar base de dados do Elfeed dentro da pasta do Emacs
</span>  (<span style="font-weight: bold;">setq</span> elfeed-db-directory
        (expand-file-name <span style="font-style: italic;">"elfeed/"</span> user-emacs-directory))

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Pasta para downloads de anexos
</span>  (<span style="font-weight: bold;">setq</span> elfeed-enclosure-default-dir
        (expand-file-name <span style="font-style: italic;">"~/Downloads/"</span>))

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Mostrar apenas artigos n&#227;o lidos das &#250;ltimas 2 semanas
</span>  (<span style="font-weight: bold;">setq</span> elfeed-search-filter <span style="font-style: italic;">"@2-weeks-ago +unread"</span>)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Ordenar artigos do mais recente para o mais antigo
</span>  (<span style="font-weight: bold;">setq</span> elfeed-sort-order 'descending)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Usar clipboard do sistema
</span>  (<span style="font-weight: bold;">setq</span> elfeed-search-clipboard-type 'CLIPBOARD)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Ajustes visuais da lista
</span>  (<span style="font-weight: bold;">setq</span> elfeed-search-title-max-width 100)
  (<span style="font-weight: bold;">setq</span> elfeed-search-title-min-width 30)
  (<span style="font-weight: bold;">setq</span> elfeed-search-trailing-width 25)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">N&#227;o mostrar URLs enormes por completo
</span>  (<span style="font-weight: bold;">setq</span> elfeed-show-truncate-long-urls t)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Cada artigo aberto recebe o seu pr&#243;prio buffer
</span>  (<span style="font-weight: bold;">setq</span> elfeed-show-unique-buffers t)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Formato da data
</span>  (<span style="font-weight: bold;">setq</span> elfeed-search-date-format
      '(<span style="font-style: italic;">"%d-%m-%Y %H:%M"</span> 20 <span style="font-weight: bold;">:left</span>))

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Desativar curl externo
</span>  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">O backend interno costuma ser suficiente
</span>  (<span style="font-weight: bold;">setq</span> elfeed-use-curl nil)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">N&#250;mero m&#225;ximo de liga&#231;&#245;es simult&#226;neas
</span>  (<span style="font-weight: bold;">setq</span> elfeed-curl-max-connections 10)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Carregar feeds a partir de ficheiro separado
</span>  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">O ficheiro deve conter:
</span>  <span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">
</span>  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(setq elfeed-feeds
</span>  <span style="font-weight: bold; font-style: italic;">;;       </span><span style="font-weight: bold; font-style: italic;">'(("https://site.com/feed.xml" tag1 tag2)
</span>  <span style="font-weight: bold; font-style: italic;">;;         </span><span style="font-weight: bold; font-style: italic;">("https://outro-site.com/rss" linux emacs)))
</span>  <span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">
</span>  (<span style="font-weight: bold;">unless</span> (<span style="font-weight: bold;">bound-and-true-p</span> elfeed-feeds)
    (load <span style="font-style: italic;">"/media/etbcf/Stuff/feeds.el"</span> <span style="font-weight: bold;">:no-error</span> <span style="font-weight: bold;">:no-message</span>))

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Destacar feeds pessoais
</span>  (add-to-list
   'elfeed-search-face-alist
   '(personal bold-italic)))

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga68807e" class="outline-2">
<h2 id="orga68807e">Ativar winner-mode</h2>
<div class="outline-text-2" id="text-orga68807e">
</div>
<div id="outline-container-org8cd6743" class="outline-3">
<h3 id="org8cd6743">Winner-mode</h3>
<div class="outline-text-3" id="text-org8cd6743">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(winner-mode 1)

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org8476c19" class="outline-2">
<h2 id="org8476c19">Burly</h2>
<div class="outline-text-2" id="text-org8476c19">
<p>
Guardar disposições de janelas, buffers, layouts, posição de cursores e outros
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> burly
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> bookmark-save-flag 1)
  (burly-tabs-mode 1)

  <span style="font-weight: bold;">:bind</span>
  ((<span style="font-style: italic;">"C-c s s"</span> . burly-bookmark-windows)
   (<span style="font-style: italic;">"C-c s f"</span> . burly-bookmark-frames)
   (<span style="font-style: italic;">"C-c s o"</span> . burly-open-bookmark)))

</pre>
</div>
</div>
</div>
<div id="outline-container-org84f37ef" class="outline-2">
<h2 id="org84f37ef">Modeline</h2>
<div class="outline-text-2" id="text-org84f37ef">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">setq-default</span>
 mode-line-buffer-identification
 '(<span style="font-weight: bold;">:eval</span>
   (<span style="font-weight: bold;">if</span> buffer-file-name
       (abbreviate-file-name buffer-file-name)
     <span style="font-style: italic;">"%b"</span>)))

</pre>
</div>
</div>
</div>
