docs/dotemacs.html
<div id="outline-container-org4686c7b" class="outline-2">
<h2 id="org4686c7b">IELM</h2>
<div class="outline-text-2" id="text-org4686c7b">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">efs/ielm-send-line-or-region</span> ()
  (<span style="font-weight: bold;">interactive</span>)
  (<span style="font-weight: bold;">unless</span> (use-region-p)
    (forward-line 0)
    (set-mark-command nil)
    (forward-line 1))
  (backward-char 1)
  (<span style="font-weight: bold;">let</span> ((text (buffer-substring-no-properties (region-beginning)
                                              (region-end))))
    (<span style="font-weight: bold;">with-current-buffer</span> <span style="font-style: italic;">"*ielm*"</span>
      (insert text)
      (ielm-send-input))

    (deactivate-mark)))

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">efs/show-ielm</span> ()
  (<span style="font-weight: bold;">interactive</span>)
  (select-window (split-window-vertically -10))
  (ielm)
  (text-scale-set 1))

(define-key org-mode-map (kbd <span style="font-style: italic;">"C-c C-l"</span>) 'efs/ielm-send-line-or-region)
(define-key org-mode-map (kbd <span style="font-style: italic;">"C-c E"</span>) 'efs/show-ielm)

</pre>
</div>
</div>
</div>
<div id="outline-container-orgf0fdcd5" class="outline-2">
<h2 id="orgf0fdcd5">Simple-httpd</h2>
<div class="outline-text-2" id="text-orgf0fdcd5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">use-package</span> simple-httpd)

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</p>
</div>
</body>
</html>
